[
    {
    "badge":[null],
    "talent":[["youtu.be","/1aUNIXaGDq8","Hosanna brothers (with Tochukwu Ibekwe)","https://i.ytimg.com/vi/1aUNIXaGDq8/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgBzgaAAuADigIMCAAQARhlIFYoSDAP&rs=AOn4CLA_kcgQEIW1Q1PDcDwLSqe1iyvdXg"],["youtu.be","/cMFj93gKpeQ","RIWE OTITO - Recieve the Praise (by Tochukwu Ibekwe)","https://i.ytimg.com/an_webp/cMFj93gKpeQ/mqdefault_6s.webp?du=3000&sqp=CKCFgrMG&rs=AOn4CLCxQc7RIopyi71FHd2WdZLSaoTCJQ"],["youtu.be","/Yqof76hmCOI","DERE DÛ (by Tochukwu Ibekwe)","https://i.ytimg.com/vi/Yqof76hmCOI/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAArwFigIMCAAQARhlIFIoUzAP&rs=AOn4CLBZ2Av1uOSWZF3gGrbClSxqsRYo1Q"],["youtu.be","/gMRqiAhjqRk","GREAT GOD (by Tochukwu Ibekwe)","https://i.ytimg.com/vi/gMRqiAhjqRk/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB1AaAAuADigIMCAAQARh_IDsoLzAP&rs=AOn4CLAGAz05LvAu4lV2F_eBuDLZlnRerQ"],["youtu.be","/kE3m8a8EIFo","NSO (by Tochukwu Ibekwe)","https://i.ytimg.com/vi/kE3m8a8EIFo/hqdefault.jpg?sqp=-oaymwE2CNACELwBSFXyq4qpAygIARUAAIhCGAFwAcABBvABAfgB_gmAAtAFigIMCAAQARhOID8ofzAP&rs=AOn4CLC2P2o06Uik7v7DxAOP06Zhb_Rv7g"]],
    "list":"Roster For Sunday Workers Meeting (Open Heaven)\nDATES\t\t\t\t\t\t\t\t\tNAMES\n07/01/24 - Sis Bola Raymond \n14/01/24 - Sis Ijeoma Akhogba \n21/01/24 - Sis Chinyere Felix \n28/01/24 - Sis Keji Olabiyi \n04/02/24 - Bro Nathan Nathan \n11/02/24 - Sis Joy Jonah \n18/02/24 - Sis Irene Warmate \n25/02/24 - Bro Toryila Peter \n03/03/24 - Sis Orji Okoro Mmerechi \n10/03/24 - Bro Ernest Ovunwo \n17/03/24 - Sis Alfred Juliet \n24/03/24 - Sis Okunwe Precious \n31/03/24 - Sis Awoere Nnodim \n07/04/24 - Bro Johnson Pewon \n14/04/24 - Sis Letitia Iremagha \n21/04/24 - Bro Felix Ufere \n28/04/24 - Sis Bisi Akinyemi \n05/05/24 - Sis Blessing Iremagha \n12/05/24 - Sis Grace Aaron \n19/05/24 - Sis Blessing Chima \n26/05/24 - Sis Ukeme Udoette \n02/06/24 - Bro Kelechi Peter \n09/06/24 - Bro Awuzieke Fidelis \n30/06/24 - Sis Letitia Iremagha \n07/07/24 - Bro Felix Ufere \n14/07/24 - Sis Irene Akinola \n21/07/24 - Bro Johnson Pewon \n28/07/24 - Sis Bola Raymond \n04/08/24 - Bro Friday Idegbesor \n11/08/24 - Sis Irene Warmate \n18/08/24 - Bro Emmanuel Udoette \n25/08/24 - Sis Bisi Akinyemi \n01/09/24 - Bro Ernest Ovunwo \n08/09/24 - Sis Chinyere Felix \n15/09/24 - Bro Peter Ekene \n22/09/24 - Sis Grace Aaron \n29/09/24 - Bro Fidelis Awuzieke \n06/10/24 - Sis Blessing Iremagha \n13/10/24 - Bro Nwankwoala Chima \n20/10/24 - Sis Orji Okoro Mmerechi \n27/10/24 - Sis Isabel Godspower Chuku \n03/11/24 - Sis Keji Olabiyi \n10/11/24 - Bro Toryila Peter \n17/11/24 - Sis Favour Umure \n24/11/24 - Bro Godwin Mgba \n01/12/24 - Sis Joy Jonah \n08/12/24 - Bro Felix Ufere \n15/12/24 - Sis Awoere Nnodim \n22/12/24 - Sis Alfred Juliet \n29/12/24 - Sis Ukeme Udoette",
    "about":"(Extracted from the church building dedication & thanksgiving service write-up)\n\nFor a church that started with five families in a small bungalow built on leased land, the idea of what we now have as \"Hosanna Towers\" was nothing but an expensive joke! But here we are today, experiencing the reality of the joke. Please sit tight as we take you through the journey of how we got here, \"for with God nothing shall be impossible\" (Luke 1:37)\n\nHosanna Parish was planted on 21st December 2006` by Pastor Tunji Ashaolu of House of Grace, under what was then RCCG Rivers Province 2. The church was started by Brother Bayo Balogun leading five families as founding members at #3 Omachi lane, Rumurolu Woji, on a plot of land leased to the church by the late Chief Amadi (who later became a member of the church with his entire family). Within the space of two years, the church grew so fast that it became an area headquarters in 2008` with Pastor Olumuyiwa Dada as the Area Pastor. In the same year, the church acquired the plots of land on which this magnificent edifice is sited.\n\nThe project and building design was nothing short of \"audacious\" but this was nothing for men \"whose hope is in the Lord\" (Psalm 146:5, Jeremiah.17:7). As a demonstration of the love of God's kingdom, work started immediately on the building project and the foundation was laid in 2009`. The project estimated in 2008` was in the eight digits and scary enough for the church but the vision and faith of the founding fathers spurred us on. Like the rebuilding of the wall of Jerusalem, everyone that has ever passed through Hosanna gave sacrificially of themselves (in cash, kind and services) and continues to give; with the pastors always leading by example.\n\nIn June 2014`, the church moved to its current (permanent) location at #8, Omachi Close, Rumurolu Woji, Port Harcourt launching the building with the solemnization of a wedding, thus heralding the beginning of a new phase. The structure had just been roofed at the time with a lot left to be done but then another challenge surfaced - the church was closed in and the hope of direct access to the main road appeared gone because a real estate development sprung up on the surrounding empty lands. But God showed up in 2015`, providing the opportunity and resources required to acquire alternative access to Illom Street in Woji, which now serves as the main access to the church premise.\n\nHosanna Tower, as we know it today, is a four-story edifice sitting on a 900sqm2 piece of land with an auditorium, gallery, and teenage church of 400, 200 and 150 sitting capacities respectively as well as ample car park space. There are special provisions for the children with four dedicated classrooms across various age groups from 0 to 12 years each with a capacity of between 50 to 60 children. The building is enhanced with fit-for-purpose toilets on various floors clearly marked for designated use and houses four administrative offices. With the passage of time and inflation, the project was delivered at more quadruple the initial estimate but by the grace of God what stood like a mountain was levelled and today we are gathered to shout \"Grace, grace unto it\" (Zechariah 4:7)\n\nHosanna Parishioners have had the privilege of being under the leadership of five Resident Pastors, two Area Pastors and one Zonal Pastor who served (and continue to) serve the Lord fervently and selflessly as follows:\n2006-2014\nBro. Bayo Balogun (Pioneer Pastor)\n2008-2016\nPst. Olumuyiwa Dada (Area Pastor)\n2014-2016\nAsst. Pst. Salami Olayiwola (Resident Pastor)\n2016-2018\nDcn. Fidelis Onyeke (Resident Pastor)\n2016-2022\nPastor Kumen Aghomon (Area Pastor)\n2018-2022\nDcn. Yomi Folayan (Resident Pastor)\n2022-2024\nBro. Kingsley Obidiozo (Resident Pastor)\n2022 to date\nPst. Temple Onyekwena (Zonal Pastor)\n\nThese pastors led by example and by the Word of God; giving of themselves, their time, and resources and have left indelible positive marks in the lives of the members. Words cannot fully express our appreciation to you all, but we believe that your labour of love will not be in vain (Amen).\n\nWe want to specially recognize the presence of our PICP 33 (Pastor David Adewuyi) and his amiable wife (Pastor Mrs Rhoda Adewuyi), the APICR 33/PICP RIV 5 (Pastor Sonny O. Wogu) and his amiable wife (Pastor Mrs Chioma Wogu), Zonal Pastor (Pastor Mrs Mina Igbere) and all the senior pastors from the Region and Province here present. Your presence is of inestimable worth, and we are grateful you found time to be here today. Immense thanks to everyone gathered here to celebrate with us and appreciate God who can do all things and from Whom all things flow, we say a BIG THANK YOU to you all.\n\nWe have indeed come a long way from where we started but definitely not at the destination, for there are still grounds to cover to make the vision of the founding fathers a reality. We therefore invite you to partner with us as we take this work to the desired place for God's glory.\n\nThank you and enjoy the beauty of God's presence\n\nSigned\nBrother Felix Ufere\nFor the Church Dedication Committee\n",
    "house":"1. Dunamis House Fellowship\n#8 Chief E.S. Woriji Avenue, off Elijiji Rd. \nTeacher: Bro Thomas Onuwe. Tel: 08066284589\n\n2. House of Peace House Fellowship \n#37 Elijiji Road, by Transformer.\nHost – Bro Chidi Samuel. Tel: 08063635906\n\n3. Winners House fellowship \nChurch Auditorium. Tel: 08035428973\n\n4. Healing House fellowship \n#3 Ilom road, Woji. \nHost – Bro Gabriel Emmanuel 08034284006 \n\n5. Mount Zion House Fellowship  \n#3 Testimony lane, off Elijiji road \nHostess: Deaconess Chidinma 08059306957\n\n6. Wisdom House Fellowship\n#13, Road 2, Lekki gardens, Ilom road \nHost – Dr Blessing 08021410541\n\n7. His Presence Hose Fellowship Center\n#29 Hope Avenue, Off Elijiji Avenue, Rumurolu. \nTeacher: Bro.Godwin Mgba (07069262071)\nHost – Bro. & Sis. Adepoju\n",
    "weekly":"SUNDAY:\nWorkers meeting\nTime: 07:30am – 08:00am\n\nSunday Service\nTime: 08:00am – 11:00am\n\nPregnant women prayer\nTime: After service\n\nHouse Fellowship\nTime: 05:00pm – 06:00pm\n\nTUESDAY\nDigging Deep (Bible Study)\nTime: 06:00pm – 07:30pm\n\nWEDNESDAY\nPrayer Band meeting\nTime: 11:00pm - 03:00am\n\nTHURSDAY\nFaith Clinic (Prayer Hour)\nTime: 05:30pm – 06:30pm\n\nSATURDAY\nEvangelism & Follow-Up\nTime: 04.00pm\n\nWorkers Preparatory meetings\nTime: 06:00pm",
    "birthday":"JANUARY\n02 - Stanley Allison\n05 - Faith Gabriel\n06 - Dike Confidence\n08 - Princely Alfred Aikodon\n09 - Uchenna Orji-Okoro\n12 - Olukayode Akinyemi\n13 - Egobucha Njoku\n13 - Precious Katolabam Johnson\n18 - James Bamidele\n24 - Precious Oyemechi\n25 - Maria Bamidele\n27 - Ernest Ovunwo\n27 - Eric Ovunwo\n30 - Nwadiukwu M. Divine\n\nFEBRUARY\n01 - Irene Warmate\n04 - Onyinyechi Awuzieke\n05 - Ukeme Udoette\n13 - Joshua Udoette\n14 - Chidinma Akwuruaha\n14 - Enefaa D Amatoru\n14 - Alfred Success\n14 - Allison Success\n16 - Mighty Dabo\n21 - Omoye Irabor\n22 - Flourish Chukwuma\n25 - Goodness Effiong Anwana\n25 - Glory Amadu\n28 - Dunamis Mbajiorgu\n\nMARCH\n03 - Amadi Miracle\n03 - Eze Chioma Helen\n04 - Moses Akinola\n07 - Ogechi Awuzieke\n08 - Toyin Adeoye\n10 - Samuel Chukwuma\n17 - Moses Dayo\n19 - Ejiro Ogege\n25 - Praise Obidiozo\n25 - Godspower Omachi\n26 - Esther Edet\n27 - Emmanuel Udoette\n27 - Ekaete Umaso\n30 - Rosalind Iyanu Bamidele\n\nAPRIL\n01 - Edith A Aigbogun\n01 - Sunday Blessing\n04 - Grace Aaron John\n04 - Nwachukwu Bright\n04 - Stanley Allison\n06 - Oluwafemi Olabiyi\n10 - Osakwe Kingsley\n12 - Favour Amaechi\n14 - Jane Mbajiorgu\n18 - Prince Tochukwu\n19 - Gbemi Adepoju\n25 - Bright Chukwuma\n28 - Chizaram Woriji\n28 - Irabor Success\n29 - Bright Ufere\n\nMAY\n02 - Olusoga Adepoju\n02 - Aigbonoga Idegbosor\n05 - Helen Ogbonna\n06 - Mmerechi Orji\n08 - Lawrence Orji\n11 - Comfort Bamidele\n14 - Toluwani Adeoye\n16 - Temitope Adeoye\n\nJUNE\n01 - Kamsiyochukwu David Chidi\n04 - Chinyere Felix\n12 - Iniobong Akpabio\n14 - Brian Omenuchi Adele\n14 - Anointing Chibueze Obioma\n16 - Eliza Chizagam Godspower\n24 - Olamide Adepoju\n24 - Gift Ogechi Obioma\n25 - Blessing Samuel\nWEDDING ANNIVERSARY\nPastor & Pastor Mrs Temple Onyekwena (29 years)\n\nJULY\n04 - Vincent Okolo\n06 - Joy Samuel\n07 - Faith Baribefi Johnson\n10 - Daniel Akinyemi\n17 - Jennifer Obasi\n20 - Raphael Asuquo\n21 - Mgba Godwin Eyinda\n22 - Mary Oduman\n27 - Favour Iheanyichi\n29 - Amarachi Iheanyichi\n29 - Jeremiah Toby\n30 - Emmanuel Oduman\n\nAUGUST\n02 - Christian O Adele\n03 - Toryila Peter J\n06 - Stanley Anwanya\n06 - Gift  Baribefii\n10 - Bola Celestina Raymond\n14 - Solomon Chukwuma\n19 - Ifemyorochukwu  Iheanyichi\n25 - Edith Uzo\n25 - Faith Amadu\n\nSEPTEMBER\n03 - Akunna Ikwuegbu\n03 - Nimi Akinyemi\n03 - Tomi Akinyemi\n08 - Irabor Praise Ese\n13 - Akani Peculiar\n14 - Blessing Nanchang\n16 - Ifeoma Akpan\n18 - Patience Ema\n19 - Beulah Ebube\n20 - Ameke Amarachi Treasure\n23 - Ozioma Robert\n25 - Nkem Adeoye\n25 - Beauty Mba\n25 - Juliet Okolo\n28 - Felix Ufere\n30 - David Chukwuma\n\nOCTOBER\n01 - Agnes Moses\n03 - Aladum Gloria\n08 - Margaret Adele\n08 - Christiana Mohammed\n10 - Aaron Itodo John\n12 - Nneoma Orji-Okoro\n16 - Chinwe Kingsley\n19 - Oratu Michael\n20 - Margaret Odumah\n23 - Awuzieke  Fidelis\n23 - Irene Akinola\n23 - Darlington Njoku\n24 - Precious Okunwe\n25 - Glory Nnamso\n28 - Kelechi Amuga\n30 - Maureen Chika Nwachukwu\n\nNOVEMBER\n01 - Perfect Fadum Johnson\n01 - Praise Nakare Johnson\n05 - Esther Akinola\n05 - Nwankwoala Chima\n08 - Keji Olabiyi\n08 - Chinaza Orji-Okoro\n11 - Oludele John Ayo\n22 - Letom Kpakol\n22 - Awoere Nnodim\n24 - Godspower Chuku Dinne\n25 - Munachi Amuga\n25 - Solomon Effiong\n27 - Favour Chijioke\n27 - Emmanuel Ime\n28 - Alfred Juliet\n\nDECEMBER\n03 - Blossom Ufere\n04 - Blessing Godwin\n06 - Christopher Uzoma\n26 - Olabisi Akinyemi\n26 - Nkechi Nwala\n27 - Favour Umoren\n30 - Happiness Chukwuma",
    "others":"Are you a new Christian?\nPlease join the believer’s class by 8am every Sunday upstairs in the church gallery to help you get rooted as a child of God. God bless you.\n\nTithe\nYou can pay your tithe online by making a transfer to RCCG HOSANNA PARISH Account 0362153126 Ecobank.\n\nWelfare\nPlease Contribute to Welfare\nRCCG HOSANNA PARISH WELFARE Account 0542010377 Ecobank.\n\nChurch Enablers/Partners\nIf you will like to join the Church Enablers/Partners kindly make your monthly contribution to: RCCG Hosanna Parish workers account. Account no: 2160021823 Ecobank. Transfer remarks “Enablers”\n\nFor counselling\nplease call any of these numbers: 08037994316, 08033641800 & 08023620708.\n",
    "overflow_tag": "WEDDING ANNIVERSARY][JANUARY][FEBRUARY][MARCH][APRIL][MAY][JUNE][JULY][AUGUST][SEPTEMBER][OCTOBER][NOVEMBER][DECEMBER][SUNDAY][TUESDAY][WEDNESDAY][THURSDAY][SATURDAY][Are you a new Christian?][Tithe][For counselling][Church Enablers/Partners][Welfare][DATES][NAMES][1. Dunamis House Fellowship][2. House of Peace House Fellowship][3. Winners House fellowship][4. Healing House fellowship][5. Mount Zion House Fellowship][Hostess][6. Wisdom House Fellowship][7. His Presence Hose Fellowship Center][Teacher][Host][(Extract from the church building dedication & thanksgiving service write-up)][Hosanna Tower][Hosanna Parishioners][Hosanna Parish][2006-2014][2008-2016][2014-2016][2016-2018][2016-2022][2018-2022][2022-2024][2022 to date",

    "month":"12",
    "year":2024,
    "theme":"CROWNED WITH GOODNESS",
    "text":"PSALM 65:11",
    "note":"“Thou crownest the year with thy goodness; And thy paths drop fatness.” [KJV]",
    "home":"Happy New Month dearly beloved. It’s the last month of the year, and glory be to God for the grace to be alive, hale and hearty. The Almighty God in His infinite mercy, started this year with us, has preserved our lives, and moved us from glory to greater glory hitherto. He will see us through to the end of this year in peace, joy and abundant blessings in Jesus Mighty name.\n\nThe above scripture passage says God crowns the year with His goodness. Looking at the dictionary, among others, crown means a reward of victory or mark of honor. It also means a royal or imperial headdress or cap of sovereignty. Another meaning of crown that really caught my attention is something that imparts splendor, honor, or finish. In the same way that a crown encircles your head, God promised to crown the year with His goodness and abundance.\n\nMy prayers for you as you step into the last month of this year is that God will crown it with His goodness for you and your household in Jesus Mighty name. Your desires may not be exactly as mine, but no matter what and where your shoes may be pinching you, the Lord is capable of settling you. May His Goodness and Mercy continue to follow you as you approach the end of this year and may your paths continue to drop fatness (abundance). The Bible says:\n\n\"Remember the word unto thy servant, Upon which thou hast caused me to hope. This is my comfort in my affliction: For thy word hath quickened me.\" Psalm 119:49-50 KJV\n\nBeloved, do you have faith or hope in the Word of God? Do you believe that the above scripture is for you? If yes, I enjoin you to begin to declare the manifestation into your life and call forth all the goodness you want God to crown this year with and for you. Call forth your victory; call forth your blessings; call forth your settlement and promotion etcetera.\nGod's blessings are not just material but deeply spiritual. The fatness of His paths includes joy, peace, and a deep sense of His presence.\n\nPhilippians 4:19: \"But my God shall supply all your need according to his riches in glory by Christ Jesus.\"\n\nWhen God blesses us, it is not just for our benefit but so that we can be a blessing to others. His goodness flows through us to impact the world.\n\n2 Corinthians 9:8: \"And God is able to make all grace abound toward you; that ye, always having all sufficiency in all things, may abound to every good work.\"\n\nAsk God to fill you with His goodness, not only for your sake but so you can overflow into the lives of others. Be intentional about sharing His blessings—whether through acts of kindness, words of encouragement, or the sharing of the gospel.\n\nConclusion\nPsalm 65:11 is a powerful reminder of God’s sovereignty and His desire to bless His creation. He crowns the year with His goodness and promises abundance along His paths. As we reflect on this truth:\n\tLet us thank Him for His past faithfulness.\n\tLet us walk faithfully in His ways.\n\tLet us live expectantly, trusting that His blessings will overflow into every aspect of our lives.\n\nHowever, in other to enjoy the maximum benefits of God’s goodness in this new month in particular and indeed all the days of your life, please make sure you stay connected with Jesus Christ. If you have not yet accepted Him as your Lord and Saviour, please do now. Believe in your heart and confess with your mouth that Jesus is Lord and you will be save. Please repent of your sins and turn from your evil ways and it shall be well with your soul in Jesus name.\n\nOnce again, happy new month and stay blessed.\n\nPASTOR TEMPLE ONYEKWENA\nPICZ - HOSANNA PARISH\n",
    "family_title":"10 PRINCIPLES TO KEEP CHRIST AT THE CENTER OF YOUR HOME",
    "family_text":"Jesus Christ came to earth to fulfil a purpose, if we practice the following principles, Christ—and His purposes for our lives—will truly be at the center of our home.\n\nHis purposes for our lives\n1. Remember the Builder. Construction workers transform piles of wood into the walls of our house. They do this by following the builder’s plans. Likewise, you and your spouse will need to fill the rooms of your home according to the Builder’s design-with love, and wisdom, and understanding. “For every house is built by someone, but the builder of all things is God.” (Hebrews 3:4)\n\n2. Seek knowledge. Ask God to give you wisdom and understanding in your relationships and decisions. It will take spiritual wisdom and understanding to transform your house into a Christ-centered home. And that knowledge can only come from God. “We have not ceased to pray for you and to ask that you may be filled with the knowledge of His will in all spiritual wisdom and understanding.” (Colossians 1:9)\n\n3. Be on the alert for evil. Satan does not want us, our friends, or loved ones to follow Jesus. There are thieves in this world who want to rob and take what is not theirs. Because of this, you and your spouse may join a neighborhood watch group in your community. Yet, what about the spiritual dangers that will attempt to invade your home? You will need to be on the alert for evil and not allow it to enter. “Be of sober spirit, be on the alert. Your adversary, the devil, prowls around like a roaring lion, seeking someone to devour.” (1 Peter 5:8)\n\n4. Follow God’s directions. As you follow God’s directions in your home, you will be filled with His joy. Friends and family won’t know how to get to your house until we give them the address. If they follow it correctly, they’ll end up at your house. Likewise, God gives you clear directions for each day that are found in His Word. When you follow His precepts, you will be filled with His joy. “I will meditate on Your precepts and regard Your ways …Your statutes are my songs in the house of my pilgrimage.” (Psalm 119:15, 54)\n\n5. Keep God’s bigger picture in mind. As we seek our neighbors’ good before our own, we will model Christ to a watching world. As each house is unique, so too are the individuals who are living near us. If we truly follow Christ’s example, we will look at the big picture as we interact with our neighbors. How will what we say and do impact their thoughts of Christ? In 1 Corinthians 13:5 the Bible says that love cares more for others than for self. That means that I need to care more about showing God’s love to my new neighbors than pleasing myself. “For the sake of the house of the Lord our God, I will seek your good.” (Psalm 122:9)\n\n6. Live in unity. Harmony and peace will mark our home and relationships when our actions match Christ’s desires. It would be terrible if an earthquake destroyed our home. But it would be far worse if misunderstanding and confusion split our hearts apart. Living in unity is the mark of a home centered on Jesus Christ. “If a house is divided against itself, that house will not be able to stand.” (Mark 3:25)\n\n7. Seek understanding. As I seek to understand others in my house, it will become a Christ-centered home. Time and effort would be invested in preparing the lot for our house and in pouring a solid foundation. And after it is built, the rooms will be filled with material possessions. But those material possessions will not transform our house into a home. We’ll need understanding to center (establish) it on Christ. “By wisdom a house is built, and by understanding it is established; and by knowledge the rooms are filled with all precious and pleasant riches.” (Proverbs 24:3-4)\n\n8. Ask God to bless your home. And let others know of His faithfulness. If our builder does a wonderful job constructing our home, he will likely ask us to endorse his work. We will be happy to tell others about his expertise as a builder. Likewise, when we move into our (new) house, we will ask God to bless it. We will also tell others of His faithfulness over the decades of our married life. “May it please You to bless the house of Your servant …” (2 Samuel 7:29)\n\n9. Choose every day to serve the Lord. No matter what our culture says, we will choose God’s ways. We can either take good care of our house or neglect it. It can be a place of refuge and beauty, or it could eventually become dilapidated. The choice is ours. Likewise, every day you and your spouse will choose whether you will serve yourselves or the Lord. Will you be selfish or selfless? Will you be patient and kind, or jealous and rude? “Choose for yourselves today whom you will serve … but as for me and my house, we will serve the Lord.” (Joshua 24:15)\n\n10. Remember that the Master of the home [the Lord] will return. May you be aware each day that your house ultimately belongs to the Lord. You and you spouse may live in your house for a year, decades, or more. You can consider it yours, or remember that it is ultimately the Master’s. One day the Lord will return and ask how you used His house. Will it be a haven for the weary? Will you tell others about Jesus within its walls? Will you be found faithful? Will you fulfill the purpose God has for your home? “It is like a man away on a journey, who upon leaving his house and putting his slaves in charge, assigning to each one his task, also commanded the doorkeeper to stay on the alert. Therefore, be on the alert—for you do not know when the master of the house is coming …” (Mark 13:34-35)\n",
    "family_site":"https://www.familylife.com/uncategorized/10-principles-to-keep-christ-at-the-center-of-your-home/",
    "hymn_total": 5,
    "hymn_title1":"PRAISE TO THE LORD, THE ALMIGHTY",
    "hymn_body1":"1. Praise to the Lord, the Almighty, the King of creation!\nO my soul, praise Him, for He is thy health and salvation!\nAll ye who hear, Now to His temple draw near;\nSing now in glad adoration!\n\n2. Praise to the Lord, who o’er all things so wondrously reigneth,\nWho, as on wings of an eagle, uplifteth, sustaineth.\nHast thou not seen How thy desires all have been\nGranted in what He ordaineth?\n\n3. Praise to the Lord, who hath fearfully, wondrously, made thee!\nHealth hath vouchsafed and, when heedlessly falling, hath stayed thee.\nWhat need or grief Ever hath failed of relief?\nWings of His mercy did shade thee.\n\n4. Praise to the Lord, who doth prosper thy work and defend thee,\nWho from the heavens the streams of His mercy doth send thee.\nPonder anew What the Almighty can do,\nWho with His love doth befriend thee.\n\n5. Praise to the Lord! Oh, let all that is in me adore Him!\nAll that hath life and breath, come now with praises before Him!\nLet the Amen Sound from His people again;\nGladly for aye we adore Him.\n",
    "hymn_title2":"O COME, ALL YE FAITHFUL!",
    "hymn_body2":"1. O come, all ye faithful, joyful and triumphant,\nO come ye, O come ye to Bethlehem!\nCome, and behold Him, born the King of angels!\n\nO come, let us adore Him;\nO come, let us adore Him;\nO come, let us adore Him, Christ, the Lord!\n\n2. God of God, Light of Light,\nlo, He abhors not the virgin's womb;\nvery God, begotten not created;\n\nO come, let us adore Him;\nO come, let us adore Him;\nO come, let us adore Him, Christ, the Lord!\n\n3. Sing, choirs of angels; sing in exultation;\nsing, all ye citizens of heav'n above!\nGlory to God, all glory in the highest!\n\nO come, let us adore Him;\nO come, let us adore Him;\nO come, let us adore Him, Christ, the Lord!\n\n4. Yea, Lord, we greet Thee, born this happy morning;\nJesus, to Thee be all glory giv'n!\nWord of the Father, now in flesh appearing!\n\nO come, let us adore Him;\nO come, let us adore Him;\nO come, let us adore Him, Christ, the Lord!\n",
    "hymn_title3":"ANGELS FROM THE REALMS OF GLORY",
    "hymn_body3":"1. Angels from the realms of glory,\nwing your flight o'er all the earth;\nye who sang creation's story\nnow proclaim Messiah's birth\n\nCome and worship, come and worship,\nworship Christ, the newborn king.\n\n2. Shepherds, in the field abiding,\nwatching o'er your flocks by night,\nGod with us is now residing;\nyonder shines the infant light:\n\nCome and worship, come and worship,\nworship Christ, the newborn king.\n\n3. Sages, leave your contemplations,\nbrighter visions beam afar;\nseek the great Desire of nations;\nye have seen his natal star:\n\nCome and worship, come and worship,\nworship Christ, the newborn king.\n",
    "hymn_title4":"JOY TO THE WORLD",
    "hymn_body4":"1. Joy to the world, the Lord is come!\nLet earth receive her King!\nLet every heart prepare Him room,\nand heav'n and nature sing,\nand heav'n and nature sing,\nand heav'n, and heav'n and nature sing.\n\n2. Joy to the earth, the Savior reigns!\nLet men their songs employ,\nwhile fields and floods, rocks, hills, and plains\nrepeat the sounding joy,\nrepeat the sounding joy,\nrepeat, repeat the sounding joy.\n\n3. No more let sins and sorrows grow,\nnor thorns infest the ground;\nHe comes to make His blessings flow\nfar as the curse is found,\nfar as the curse is found,\nfar as, far as the curse is found.\n\n4. He rules the world with truth and grace,\nand makes the nations prove\nthe glories of His righteousness\nand wonders of His love,\nand wonders of His love,\nand wonders, wonders of His love.\n",
    "hymn_title5":"",
    "hymn_body5":"",
    "hymn_tag":"",
    "home_tag":"",
    "family_tag":""
  },
  {
    "month":"11",
    "year":2024,
    "theme":"ELEVENTH HOUR MIRACLE",
    "text":"Matthew 20:1-12",
    "note":"“For the kingdom of heaven is like unto a man that is an householder, which went out early in the morning to hire labourers into his vineyard. And when he had agreed with the labourers for a penny a day, he sent them into his vineyard. And he went out about the third hour, and saw others standing idle in the marketplace, And said unto them; Go ye also into the vineyard, and whatsoever is right I will give you. And they went their way. Again he went out about the sixth and ninth hour, and did likewise. And about the eleventh hour he went out, and found others standing idle, and saith unto them, Why stand ye here all the day idle? They say unto him, Because no man hath hired us. He saith unto them, Go ye also into the vineyard; and whatsoever is right, that shall ye receive. So when even was come, the lord of the vineyard saith unto his steward, Call the labourers, and give them their hire, beginning from the last unto the first. And when they came that were hired about the eleventh hour, they received every man a penny. But when the first came, they supposed that they should have received more; and they likewise received every man a penny. And when they had received it, they murmured against the goodman of the house, Saying, These last have wrought but one hour, and thou hast made them equal unto us, which have borne the burden and heat of the day.” [KJV]",
    "home":"Gradually, the year is winding down. The 11th month is already winding down but it is also a season of unexpected miracles for those that believe.\n\nBrethren, what we must not lose when we pray is hope.  When you are hopeful, you are expectant. However physically speaking, at a time like this, many tend to lose hope or get depressed especially when there seems to be no answers to prayers. It is only human to feel that way but for those who are true believers and know that with God all things are possible, such people would encourage themselves in the LORD.\n\nIt is the eleventh month.  Eleventh hour miracles happen suddenly especially for those that have lost hope or people that have started losing faith as a result of unanswered prayers. When prayers seem unanswered, the solution is not to give up but to intensify prayers. A time comes in the life of person when it seems that physically speaking, a miracle seems impossible. What do I mean?\n\nIf a lady is single at 49, naturally, she would have concluded that she is unlikely to get anyone to marry let alone have children. When we begin to think like this, God suddenly arises.\n\nHealings happen suddenly too when God is involved.  A surgeon may carry out an operation on a patient, administer drugs but cannot tell the exact date of healing. Brethren, our God is awesome.\n\nAn eleventh hour miracle manifests when it is least expected. Let’s look at the parable of the eleventh hour in Matthew 20 vs. 1-12 ( KJV) . For our purpose, we’ll consider some of the verses. Verses 1&2:  For the kingdom of heaven is like unto a man that is an householder, which went out early in the morning to hire labourers into his vineyard. And when he had agreed with the labourers for a penny a day, he sent them into his vineyard”. But there were some labourers that were idle because they hadn’t been hired and were unsure of earning even a penny on that day. Verses 6&7: “And about the eleventh hour he went out, and found others standing idle, and saith unto them, Why stand ye here all the day idle? They say unto him, Because no man hath hired us.  He saith unto them, Go ye also into the vineyard:  and whatsoever is right, that shall ye receive”.\n\nNote that some labourers have been working since morning before the householder asked this last set of labourers to join them.  In other words, others had done a good part of the work.\n\nThis last set would only be engaged in finishing. Let’s see what happened when the hour of reward came. Verses 8 – 12 completes the story: “ So when even was come, the lord of the vineyard saith unto his steward, call the labourers, and give them their hire beginning from the last unto the first. And when they came that were hired about the eleventh hour, they received every man a penny. But when the first came, they supposed that they should have received more: and they likewise received every man a penny.\n\nAnd when they had received it, they murmured against the good man of the house saying, these last have wrought but one hour, and thou has made them equal unto us, which have borne the burden and heat of the day”. Brethren, did you get the point.  The last set of labourers received mercy.  They had concluded that they would go home empty handed for that day. They knew that since they didn’t work, they would earn nothing. But God showed them mercy; they put in little effort and received the same reward as labourers that had been working for hours. In the name of Jesus Christ, by the mercy of God your little effort will produce amazing results when you least expected.\n\nHave you been denied promotion in your office?  Be calm, keep praying, God is working on your behalf.  By the time the God of mercy shows up for you, you will be the one that would benefit from the labour that others ahead of you had put in. Brothers and Sisters, you may have spent so much on medical tests to facilitate conception with no results to show for it. Keep praying. Don’t lose hope. Pray with vows, fast, if you can,  appreciate the Lord with praise, God in his mercy will show up suddenly for you. I’ll share with you the story of a friend who did everything humanly possible to have a child in her 19 years of marriage but none came. She became a subject of mockery but she insisted she would wait on the Lord. She gave her apartment up for prayer meetings every week. Still nothing happened. Rather than receive answers to her prayer, she fell sick.  It was so bad that no one was allowed to visit her in the hospital but her husband kept faith that she would not die. He called on his friends to assist his bed-ridden wife with prayers. To shorten this story, the woman was discharged but she looked so frail that it was difficult to recognize her. Barely a year after, she conceived.  She said, she was so shocked; she didn’t know how to appreciate God. She began to say to herself, “ baby where have you been all these years? Finally, she put to bed a baby boy. Let me explain this short testimony. Brethren, what happened to the woman was an attack of the enemy that wanted to terminate her life so that she would never be a testifier.\n\nBut our God is greater than any force of darkness.  Before the enemy moves, God knows how to bring his efforts to naught. If she had died, she would have died childless but God’s plan for her was to use her story as an inspiration for others.\n\nWhat if she had stopped praying or turned to man made idol gods, then she would have died. She would never have celebrated motherhood.\n\nI may not know what your desires are, I urge you to begin to pray that the merciful God should give you an eleventh hour miracle. God’s ears are open to our prayers and the Lord can answer our prayers. Make up your mind that you would not end this year without that miracle that you so desire.\n\nThe eleventh month is the month of good news. How do I know?  The Holy Bible is my witness. Zachariah 1 vs. 7: The word of the Lord that came in the eleventh month is good news. I pray the word of the LORD that would bring an end to that challenge will come forth for you before the end of this month in Jesus name. Brethren, the eleventh month is not the time to give up. It is the time to brace up.\n\nFinally, Being Born again is your access to the God’s eleventh hour miracle. If you will like to receive Jesus in your heart, Pls Pray: “Dear Lord Jesus, have mercy upon me a sinner, I am sorry for all my sins. I believe you died to save me. Pls be my Lord and savior henceforth in Jesus Name I pray”. Congratulations you are now a child of God. Pls reach out to us for follow up and endeavor to join the new believers’ class for teachings to help you grow. The class holds upstairs at the church gallery on Sundays by 8am. God bless you.\n\nPASTOR TEMPLE ONYEKWENA\nPICZ - HOSANNA PARISH\n",
    "family_title":"CHRISTIAN MARRIAGE ADMONITION",
    "family_text":"A Christ-centered marriage is built on the love of Christ, the foundation of selfless, sacrificial love that models His relationship with the Church (Ephesians 5:25-33). This love goes beyond personal gain or conditions, encouraging each spouse to prioritize the other’s well-being and foster an environment of patience, kindness, and humility. In a world that often promotes conditional love, Christ’s love challenges couples to embrace a higher standard—one that endures and forgives.\n\nMarriage is a covenant, not merely a contract. Philippians 2:3-4 calls believers to humility, valuing others above themselves. For a married couple, this means committing to serve each other daily, offering kindness, support, and encouragement. Serving your spouse reflects the humility and selflessness that Christ demonstrated, making your marriage a testament to God’s love.\n\nUnity and prayer strengthen marriage. Ecclesiastes 4:9-12 emphasizes that a “cord of three strands is not quickly broken,” representing you, your spouse, and God. Facing life’s challenges together in prayer creates a resilient bond, aligns your hearts with God, and invites His presence into your relationship. Make time to pray for and with each other regularly; a spiritually united couple is stronger and more prepared for the inevitable trials.\n\nForgiveness is essential for any lasting relationship. Ephesians 4:32 urges believers to “forgive each other, just as in Christ God forgave you.” In marriage, this means addressing wrongs and letting go of bitterness. Rather than allowing hurt to fester, seek to resolve issues lovingly and with grace. A marriage grounded in forgiveness reflects Christ’s mercy and is healthier and more harmonious.\n\nFaithfulness and fidelity go beyond physical loyalty to include emotional and spiritual commitment (Matthew 19:6). Faithfulness means dedicating your heart, mind, and soul to your spouse alone, maintaining transparency, and protecting your relationship from harmful influences. This loyalty is a reflection of God’s unwavering commitment to His people, providing a strong example for others.\n\nCommunication is fundamental. Proverbs 15:1 says, “A gentle answer turns away wrath, but a harsh word stirs up anger.” Speak kindly and openly, listening with patience and humility. Miscommunication can easily lead to resentment, so work to express needs and resolve conflicts with a spirit of respect and understanding. Building a foundation of clear, compassionate communication strengthens the bond between you.\n\nMarriage is also a gift meant to bring joy and companionship (Ecclesiastes 9:9). Amid responsibilities and challenges, remember to laugh together and find joy in each other’s company. Quality time nurtures your friendship and reflects the gratitude you have for each other, reminding you of God’s blessings.\n\nFinally, keep God at the center (Matthew 6:33). A marriage aligned with God’s will endures through any storm. As you grow in love, faith, and unity, your marriage becomes a testimony to the world of God’s grace and love. Cherish this journey, always striving to reflect Christ’s love, honor, and faithfulness in every aspect of your relationship.\n",
    "family_site":"Journal",
    "hymn_total": 4,
    "hymn_title1":"IMMORTAL, INVISIBLE, GOD ONLY WISE",
    "hymn_body1":"1. Immortal, invisible, God only wise,\nin light inaccessible hid from our eyes,\nmost blessed, most glorious, the Ancient of Days,\nalmighty, victorious, thy great name we praise.\n\n2. Unresting, unhasting, and silent as light,\nnor wanting, nor wasting, thou rulest in might;\nthy justice like mountains high soaring above\nthy clouds, which are fountains of goodness and love.\n\n3. To all life thou givest, to both great and small;\nin all life thou livest, the true life of all;\nwe blossom and flourish as leaves on the tree,\nand wither and perish but naught changeth thee.\n\n4. Great Father of glory, pure Father of light,\nthine angels adore thee, all veiling their sight;\nall praise we would render, O help us to see\n'tis only the splendor of light hideth thee.\n",
    "hymn_title2":"THOU MY EVERLASTING PORTION",
    "hymn_body2":"1. Thou my everlasting Portion,\nMore than friend or life to me,\nAll along my pilgrim journey,\nSavior, let me walk with Thee.\n\nClose to Thee, close to Thee,\nClose to Thee, close to Thee;\nAll along my pilgrim journey,\nSavior, let me walk with Thee.\n\n2. Not for ease or worldly pleasure,\nNot for fame my prayer shall be;\nGladly will I toil and suffer,\nOnly let me walk with Thee.\n\nClose to Thee, close to Thee,\nClose to Thee, close to Thee;\nGladly will I toil and suffer,\nOnly let me walk with Thee.\n\n3. Lead me through the vale of shadows,\nBear me o’er life’s fitful sea;\nThen the gate of life eternal\nMay I enter, Lord, with Thee.\n\nClose to Thee, close to Thee,\nClose to Thee, close to Thee;\nThen the gate of life eternal\nMay I enter, Lord, with Thee.\n",
    "hymn_title3":"WHAT A FRIEND WE HAVE IN JESUS",
    "hymn_body3":"1. What a friend we have in Jesus,\nall our sins and griefs to bear!\nWhat a privilege to carry\neverything to God in prayer!\n\nO what peace we often forfeit,\nO what needless pain we bear,\nall because we do not carry\neverything to God in prayer!\n\n2. Have we trials and temptations?\nIs there trouble anywhere?\nWe should never be discouraged;\ntake it to the Lord in prayer!\n\nCan we find a friend so faithful\nwho will all our sorrows share?\nJesus knows our every weakness;\ntake it to the Lord in prayer!\n\n3. Are we weak and heavy laden,\ncumbered with a load of care?\nPrecious Savior, still our refuge--\ntake it to the Lord in prayer!\n\nDo your friends despise, forsake you?\nTake it to the Lord in prayer!\nIn his arms he'll take and shield you;\nyou will find a solace there.\n",
    "hymn_title4":"ROCK OF AGES, CLEFT FOR ME",
    "hymn_body4":"1. Rock of Ages, cleft for me,\nLet me hide myself in Thee;\nLet the water and the blood,\nFrom Thy riven side which flowed,\nBe of sin the double cure,\nSave me from its guilt and power.\n\n2. Not the labor of my hands\nCan fulfill Thy law’s demands;\nCould my zeal no respite know,\nCould my tears forever flow,\nAll for sin could not atone;\nthou must save, and thou alone.\n\n3. Nothing in my hand I bring,\nsimply to the cross I cling;\nnaked, come to thee for dress;\nhelpless, look to thee for grace;\nfoul, I to the fountain fly;\nwash me, Savior, or I die.\n\n4. While I draw this fleeting breath,\nwhen mine eyes shall close in death,\nwhen I soar to worlds unknown,\nsee thee on thy judgment throne,\nRock of Ages, cleft for me,\nlet me hide myself in thee.\n",
    "hymn_tag":"][Close to Thee, close to Thee,\nClose to Thee, close to Thee;\nAll along my pilgrim journey,\nSavior, let me walk with Thee.][Close to Thee, close to Thee,\nClose to Thee, close to Thee;\nGladly will I toil and suffer,\nOnly let me walk with Thee.][Close to Thee, close to Thee,\nClose to Thee, close to Thee;\nThen the gate of life eternal\nMay I enter, Lord, with Thee.][",
    "home_tag":"][PASTOR TEMPLE ONYEKWENA][PICZ - HOSANNA PARISH][",
    "family_tag":"]["
  },
  {
    "month":"10",
    "year":2024,
    "theme":"DOUBLE GRACE",
    "text":"Zechariah 4:7",
    "note":"“Who are you, O great mountain? Before Zerubbabel you shall become a plain: And he shall bring forth the headstone thereof with shoutings, crying, Grace, grace to it.” [KJV]",
    "home":"Heavenly Father, we thank You for bringing us into this beautiful month of October, a month that we declare as a time of \"Double Grace.\" Let this message be a source of encouragement, empowerment, and transformation for every person here in our church. May we understand the fullness of Your grace and walk in it daily. In Jesus' name, we pray, Amen.\n\nIntroduction.\n I want to talk about the theme for this month-\"Double Grace\". Grace is a powerful gift from God, and it is something we cannot earn but can only receive freely through Jesus Christ. The Bible tells us that God's grace is sufficient for all our needs, but we are focusing on something greater-Double Grace. This means an abundant overflow of grace, an increased measure of God's unmerited favor upon our lives.\n\n1. Understanding Grace-To understand what \"Double Grace\" is, we first need to understand what grace means. Grace, in its simplest definition, is unmerited favor. It is the favor of God that we do not deserve and cannot earn. It is God’s kindness, His goodness, His power working in us and through us, even though we have done nothing to deserve it.\n\nEphesians 2:8-9 says: \"For by grace you have been saved through faith, and that not of yourselves; it is the gift of God, not of works, lest anyone should boast.\"\n\nGrace is God's gift to us, freely given through Jesus Christ. It is by His grace that we are saved, and it is by His grace that we are sustained. This grace covers our weaknesses, empowers us, and allows us to do what we could never do in our own strength.\n\n2. The Concept of Double Grace-Now, let us consider what Double Grace means. The idea of \"double\" speaks to an increase, a multiplication, an overflow beyond the usual portion. We see examples in Scripture of God giving double blessings, double portions, and even double restoration. In Zechariah 4:7, God speaks to Zerubbabel about grace:- \"Who are you, O great mountain? Before Zerubbabel you shall become a plain! And he shall bring forth the capstone with shouts of 'Grace, grace to it!'\"\n\nThe cry of \"Grace, grace!\" speaks of an overwhelming measure of God's favor. Zerubbabel faced an impossible task of rebuilding the temple, but God declared that it would not be by human might or power, but by His Spirit and His grace. In the same way, God wants to bring double grace into our lives, enabling us to accomplish what seems impossible.\n\n3. Grace That Restores and Multiplies-Let us look at another example of double grace-Job. Job experienced severe loss, but God restored him with a double portion of what he had lost. Job 42:10 says:- \"And the Lord restored Job’s losses when he prayed for his friends. Indeed, the Lord gave Job twice as much as he had before.\"\n\nThis is an example of God’s grace in action—double grace that restored and multiplied everything that Job had lost. Perhaps some of us reading this feel like we have experienced loss or are going through a season of difficulty. I want to encourage you that God’s double grace is available to you. He is a God who restores, multiplies, and blesses abundantly beyond what we can imagine.\n\n4. Grace for Our Weaknesses-Another beautiful aspect of God's grace is that it covers our weaknesses. 2 Corinthians 12:9-tells us:- \"But He said to me, 'My grace is sufficient for you, for My strength is made perfect in weakness.' Therefore most gladly I will rather boast in my infirmities, that the power of Christ may rest upon me.\"\n\nPaul speaks here of a \"thorn in the flesh,\" a weakness that he wished to be taken away. But instead of removing it, God gave Paul the grace to endure, and He told him that His grace was sufficient. In our weaknesses, God’s grace is doubled. Where we are limited, His power is unlimited. When we come to the end of ourselves, we encounter double grace—strength for our weaknesses and power that enables us to persevere.\n\n5. Grace to Do Greater Works- God's grace is not only for our salvation or to help us in our weaknesses; it is also the power that enables us to fulfill the purposes of God in our lives. 2 Corinthians 9:8 says:- \"And God is able to make all grace abound toward you, that you, always having all sufficiency in all things, may have an abundance for every good work.\"\n\nThis is the essence of double grace—an overflow of God’s favor and power so that we have everything we need to accomplish the good works that He has prepared for us. This means that no matter the task before us, whether it is ministry, work, raising a family, or impacting our community, God’s grace will abound to us, giving us all that we need to succeed.\n\n6. Living in Double Grace-How do we live in this double grace? The key is in our relationship with Jesus Christ. John 1:16- tells us:\n\"From His fullness we have all received, grace upon grace.\"\nWe receive double grace by staying connected to Jesus, the source of all grace. We must remain in constant fellowship with Him through prayer, the study of His Word, and a heart of worship. When we rely on His Spirit, He pours out grace upon grace, an overflow that empowers us in every area of our lives.\n\nEncouragement for the Church-As we enter this month of October, let us be encouraged that we have access to double grace. Whatever challenges you are facing, know that God’s grace is sufficient and abundant. If you are weak, His strength is made perfect in your weakness. If you are in need, His grace will provide. If you feel inadequate, His grace will empower you.\n\nIsaiah 61:7 says:- \"Instead of your shame you shall have double honor, and instead of confusion they shall rejoice in their portion. Therefore in their land they shall possess double; everlasting joy shall be theirs.\"\n\nGod is promising double honor, double restoration, and everlasting joy. Let us walk in this promise and live out the fullness of double grace that God has for us.\n\nBeing Born again is your access to the God’s double grace. If you will like to receive Jesus in your heart, Pls Pray: “Dear Lord Jesus, have mercy upon me a sinner, I am sorry for all my sins. I believe you died to save me. Pls be my Lord and savior henceforth in Jesus Name I pray”. Congratulations you are now a child of God. Pls reach out to us for follow up and endeavor to join the new believers’ class for teachings to help you grow. The class holds upstairs at the church gallery on Sundays by 8am.\n\nConclusion.\nDouble grace is God’s gift to each one of us. It is His favor that empowers us, sustains us, restores us, and equips us for every good work. This month, let us embrace double grace with faith, knowing that God desires to bless us beyond measure, to restore what has been lost, and to empower us to fulfill His calling on our lives.\n\nMay we walk in confidence, knowing that our God is a God of abundant grace, and may we experience the overflow of His blessings in every area of our lives.\n\nPASTOR TEMPLE ONYEKWENA\nPICZ - HOSANNA PARISH\n",
    "family_title":"THE CURSE OF COMPARISON",
    "family_text":"Like it or not, we live in a culture of comparison in which everyone assumes their rights and their entitlements. And such an atmosphere makes the culture’s soil fertile for envy.\n\nDo you ever struggle with envy? Envy can germinate in our souls when we decide to plant unwise seeds of comparison. It all starts with a prolonged look at what someone else has achieved or received, comparing what we have with what others appear to have. Generally, we can find a way to compare ourselves unfavorably with them and when we do envy inevitably takes root. When our limited perspective leads us to compare what we think we deserve with what others appear to receive, we become just like the grumblers of Jesus’ parable in Matthew 20.\n\nA Christian should avoid comparison at all costs. Don't plant the seed. Don't nurse it by watching and feeding it Instead, learn what the employees in the parable did on that hot day. Our heavenly master is just and good in all His judgments, and because He can be trusted, we can learn to be content in circumstances that by all outward appearances seem downright unfair\n\nUltimately, the choice for each of us is whether we truly believe that God is in control and that He knows what He is doing. Be careful not to fall into the trap of comparison with others, but instead learn to cultivate a heart of gratitude for the many ways God has blessed you. Ask God to give you a grateful heart as a couple and then pass that perspective onto your children.\n",
    "family_site":"Family life Marriage Bible by Dennis & Barbara Rainey",
    "hymn_total": 4,
    "hymn_title1":"GREAT IS THY FAITHFULNESS",
    "hymn_body1":"1. Great is Thy faithfulness, O God my Father;\nthere is no shadow of turning with Thee;\nThou changest not, Thy compassions, they fail not;\nas Thou hast been, Thou forever wilt be.\n\nGreat is Thy faithfulness!\nGreat is Thy faithfulness!\nMorning by morning new mercies I see;\nall I have needed Thy hand hath provided:\ngreat is Thy faithfulness, Lord, unto me!\n\n2. Summer and winter, and springtime and harvest;\nsun, moon, and stars in their courses above\njoin with all nature in manifold witness\nto Thy great faithfulness, mercy, and love.\n\nGreat is Thy faithfulness!\n Great is Thy faithfulness!\nMorning by morning new mercies I see;\nall I have needed Thy hand hath provided:\ngreat is Thy faithfulness, Lord, unto me!\n\n3. Pardon for sin and a peace that endureth,\nThine own dear presence to cheer and to guide;\nstrength for today and bright hope for tomorrow:\nblessings all mine, with ten thousand beside!\n",
    "hymn_title2":"OLD RUGGED CROSS",
    "hymn_body2":"1, On a hill far away stood an old rugged cross,\nthe emblem of suffering and shame;\nand I love that old cross where the dearest and best\nfor a world of lost sinners was slain.\n\nSo I'll cherish the old rugged cross,\ntill my trophies at last I lay down;\nI will cling to the old rugged cross,\nand exchange it some day for a crown.\n\n2, O that old rugged cross, so despised by the world,\nhas a wondrous attraction for me;\nfor the dear Lamb of God left his glory above\nto bear it to dark Calvary.\n\nSo I'll cherish the old rugged cross,\ntill my trophies at last I lay down;\nI will cling to the old rugged cross,\nand exchange it some day for a crown.\n\n3, In that old rugged cross, stained with blood so divine,\na wondrous beauty I see,\nfor 'twas on that old cross Jesus suffered and died,\nto pardon and sanctify me.\n\nSo I'll cherish the old rugged cross,\ntill my trophies at last I lay down;\nI will cling to the old rugged cross,\nand exchange it some day for a crown.\n\n4, To that old rugged cross I will ever be true,\nits shame and reproach gladly bear;\nthen he'll call me some day to my home far away,\nwhere his glory forever I'll share.\n",
    "hymn_title3":"IT IS WELL WITH MY SOUL",
    "hymn_body3":"1. When peace like a river attendeth my way,\nwhen sorrows like sea billows roll;\nwhatever my lot, thou hast taught me to say,\n\"It is well, it is well with my soul.\"\n\nIt is well with my soul;\nit is well, it is well with my soul.\n\n2. Though Satan should buffet, though trials should come,\nlet this blest assurance control:\nthat Christ has regarded my helpless estate,\nand has shed his own blood for my soul.\n\nIt is well with my soul;\nit is well, it is well with my soul.\n\n3. My sin oh, the bliss of this glorious thought!\nmy sin, not in part, but the whole,\nis nailed to the cross, and I bear it no more;\npraise the Lord, praise the Lord, O my soul!\n\nIt is well with my soul;\nit is well, it is well with my soul.\n\n4. O Lord, haste the day when my faith shall be sight,\nthe clouds be rolled back as a scroll;\nthe trump shall resound and the Lord shall descend;\neven so, it is well with my soul.\n",
    "hymn_title4":"O HAPPY DAY THAT FIXED MY CHOICE",
    "hymn_body4":"1. O happy day that fixed my choice\nOn Thee, my Savior and my God!\nWell may this glowing heart rejoice,\nAnd tell its raptures all abroad.\n\nHappy day, happy day,\nWhen Jesus washed my sins away!\nHe taught me how to watch and pray,\nAnd live rejoicing every day;\nHappy day, happy day,\nWhen Jesus washed my sins away!\n\n2. ’Tis done—the great transaction’s done;\nI am my Lord’s, and He is mine;\nHe drew me and I followed on,\nRejoiced to own the call divine.\n\nHappy day, happy day,\nWhen Jesus washed my sins away!\nHe taught me how to watch and pray,\nAnd live rejoicing every day;\nHappy day, happy day,\nWhen Jesus washed my sins away!\n\n3. Now rest, my long-divided heart,\nFixed on this blissful center, rest;\nHere have I found a nobler part,\nHere heav’nly pleasures fill my breast.\n\nHappy day, happy day,\nWhen Jesus washed my sins away!\nHe taught me how to watch and pray,\nAnd live rejoicing every day;\nHappy day, happy day,\nWhen Jesus washed my sins away!\n\n4. High heav’n that hears the solemn vow,\nThat vow renewed shall daily hear!\nTill in life’s latest hour I bow,\nAnd bless, in death, a bond so dear.\n",
    "hymn_tag":"][Great is Thy faithfulness!][Morning by morning new mercies I see;][all I have needed Thy hand hath provided:][great is Thy faithfulness, Lord, unto me!][So I'll cherish the old rugged cross,][till my trophies at last I lay down;][I will cling to the old rugged cross,][and exchange it some day for a crown.][Happy day, happy day,][When Jesus washed my sins away!][He taught me how to watch and pray,][And live rejoicing every day;][It is well with my soul;\nit is well, it is well with my soul.][",
    "home_tag":"][Introduction.][1. Understanding Grace-][Ephesians 2:8-9 says][2. The Concept of Double Grace][In Zechariah 4:7][3. Grace That Restores and Multiplies-][4. Grace for Our Weaknesses-][2 Corinthians 12:9][6. Living in Double Grace-][John 1:16][Encouragement for the Church-][Isaiah 61:7 says][Conclusion.][PASTOR TEMPLE ONYEKWENA][PICZ - HOSANNA PARISH][",
    "family_tag":"]["
  },
  {
    "month":"9",
    "year":2024,
    "theme":"DIVINE FRUITFULNESS",
    "text":"Psalm 1:3",
    "note":"“He shall be like a tree Planted by the rivers of water, That brings forth its fruit in its season, Whose leaf also shall not wither; And whatever he does shall prosper.” [NKJV]",
    "home":"To God be the glory for His abundant mercy and faithfulness for watching over us since the beginning of the year 2024. We thank God for bringing us to the month of September, the first of the “ember” months. The Lord who has brought us this far will see us to the end of the year and beyond in Jesus name. This ninth month is the month of Divine Fruitfulness.\n\nThe first words that God spoke to man after creation was to be fruitful, multiply, replenish, and subdue the earth., Genesis 1:27-28.\n\nJeremiah 17:7-8 compares a blessed man who trust in the Lord to a tree planted by the waters which spreads out its roots by the river and will not fear when heat comes; But its leaf will be green. And will not be anxious in the year of drought, Nor will cease from yielding fruit.\n\nA tree speaks of vitality, fertility, beauty, majesty, and strength. It is a symbol of blessing. This is what is expected of children of God. Prosperity is that which is given to you by the Lord which has no sorrow with it, Proverbs 10:22. The blessing of the Lord makes a person rich in many ways, good health, favor of God and man, success in one’s undertakings, godly character, and a good testimony for Jesus Christ. God puts a premium on character and being a good example, Proverbs 22:1- A good name is rather to be chosen than great riches, and loving favor rather than silver and gold.\n\nApart from material blessings which God gives His children, He expects us as Christians to bear fruits to expand His kingdom.\n\nIs there evidence of fruitfulness in your life that you are a Christian?\n\nIs the fruit of the Holy Spirit evident in your life which includes love, joy, peace, long suffering, gentleness, goodness, faith, meekness, and temperance? Galatians 5:22-23.\n\nDo you bear the fruit of service for Jesus Christ? God wants us to be like a fruitful tree! Herein is my Father glorified, that ye bear much fruit; so, shall ye be my disciples. John 15:8\n\nHow can one be fruitful? It is by taking wise counsels, walking in the commandments of the Lord God, and having footsteps that are ordered by the Word of God, and not by the cunning and wicked devices of carnality. (Psalm 1:1-2).\n\nJesus Christ in John 15:4-5 says Abide in Me, and I in you. As the branch cannot bear fruit of itself, unless it abides in the vine, neither can you, unless you abide in Me. I am the vine; you are the branches. He who abides in Me, and I in him, bears much fruit; for without Me you can do nothing.\n\nTo abide in Christ involves a surrendered will to the Lord. It means to have close fellowship with Him, worship, Scripture meditation, supplication, service, and sacrifice. May the Lord grant us the grace to abide in Him for a fruitful and prosperous life in Jesus name.\n\nPRAYER\nFather, I thank you for blessing me and making me to be Fruitful. I thank you for the honor to remain Fruitful in you. I thank you that your words are producing fruits in me. I thank you that your Spirit in me is producing abundance of Fruits as I abide in the Lord Jesus Christ.\n\nWelcome to the month of September 2024, the month of Divine Fruitfulness.\n\nPASTOR TEMPLE ONYEKWENA\nPICZ - HOSANNA PARISH\n",
    "family_title":"QUALITIES OF A STRONG CHRISTIAN FAMILY",
    "family_text":"A strong Christian family is a bonded relationship among people of the same genes that cannot be separated by either spiritual evil forces or bad social influences in society.\n\nHow Does GOD Want a Strong Christian Family to Be?\n“But from the beginning of the creation, God ‘made them male and female.’ ‘For this reason, a man shall leave his father and mother and be joined to his wife, ‘and the two shall become one flesh’; so, then they are no longer two, but one flesh.” (Mark 10:6-8)\nThe LORD wants a family to be built on the foundation of a man and woman becoming one flesh through marriage. This union is meant to be exclusive and lifelong, with the couple leaving behind their respective families to form a new generation.\n\nSo, the following cultural practices do not originate from the LORD; homosexual marriage, adoption of children by gay partners, polyandry, refusal to give birth to children, lesbian marriage, transgender and the like.\n\nJesus Christ says by their fruits you shall know them, thus any church supporting such abominable practices above is not of GOD but of the Devil.\n\nWhat is Jesus Christ’s Teaching about the Christian Family?\n“But He answered and said to the one who told Him, “Who is My mother and who are My brothers?” And He stretched out His hand toward His disciples and said, “Here are My mother and My brothers!”\n\n“For whoever does the will of My Father in heaven is My brother and sister and mother.” (Matthew 12:48-50)\n\nJesus Christ emphasized the importance of spiritual kinship, stating that those who do the will of God are his brothers, sisters, and mother. This highlights the qualities of a Christian family, which include a strong faith, a commitment to living according to God’s teachings, and a sense of unity and love among its members.\n\nUltimately, a Christian family prioritizes its relationship with God above everything on earth and seeks to live a life that reflects the LORD’s values and principles of holiness.\n\n5 Characteristics of a Strong Christian Family\nChristian families are founded on the belief that God is the center of their lives. They recognize that they are nothing without God and that He is their Creator, Savior, Healer, Comforter, and Provider.\n\n1. The husband is the head of the family and is responsible for providing for the family’s financial, emotional, and spiritual needs.\n\n2. Wife submits and respects her husband and not a lazy partner. (Proverbs 31:10-31)\n\n3. The children obey their parents and are always innocent. (Matthew 18:3-5)\n\n4. Strong Christian family serves as the salt and light of the world.\n\n5. A godly family is built upon the foundation of a strong and committed marriage.\n\n10 Qualities of a Good Christian Family\n1. No joke with the Prayer Altar\nOne of the secrets of a conflict-free family is bonding in the presence of the LORD when praying together daily for thirty minutes.\nFamily altar strengthens connection with the LORD, it increases the faith of parents and children during good and challenging times. You can all speak in one voice and pull down mountains.\n\n2. Quick to Forgive\nA strong Christian family settles their differences quickly before going to bed.\nForgiveness means letting go of anger and resentment towards others, even when they have hurt us deeply.\nThis quality makes family prayers to be answered by the LORD very fast and spirit of hatred cannot survive in such a home.\n\n3. Giving Room for Grace\nGrace means extending kindness and love to your family members, even when they don’t deserve it. It means recognizing that we are all on the learning curve to become perfect and in need of God’s grace.\n\n4. Good Communication and Listening Attitude\nCommunication and listening are essential qualities of a strong Christian family.\nCreating an environment where everyone feels comfortable expressing their thoughts and feelings is important. This means actively listening to each other without judgment or interruption.\nIt also means being willing to have difficult conversations and working through conflicts in a respectful and constructive way. By prioritizing communication and listening, you can build stronger relationships and create a more harmonious household.\n\n5. Showing Unconditional Love\nThe household of a quality strong Christian family does not have characteristics such as selfishness and self-centeredness. Agape love will allow peace and mercy from the LORD to be abundant in your home.\n\n6. Unity and Teamwork\nUnity and teamwork are crucial qualities of a strong Christian family. When family members work together towards common goals and support each other through challenges, they build a sense of unity and belonging.\nThis can be achieved through regular family meetings, where everyone has a chance to share their thoughts and feelings, and through working together on projects or activities. By fostering a sense of teamwork and unity, families can create a strong foundation for their relationships and build a sense of purpose and meaning in their lives.\n\n7. Prioritizes the Word of God\nIt is not uncommon in our generation that strange teachings and false doctrines are destroying many families but a strong Christian family cannot be affected because daily group bible study is their favourite practice.\nRead your bible together, meditate on the word of God and share scriptural revelations together. Trust me, your household will be spiritually fortified because it works for me so much.\n\n8. Wine and Dine Together\nIt’s a good practice that connects the family. Christian families prioritize spending time together and sharing meals, as practiced by the disciples of Jesus Christ. (Acts 2:46).\nYou must understand the importance of healthy eating habits and also involve your children in meal planning and preparation.\n\n9. Produces Fruits of the Spirit\nThis is a crucial quality of a strong Christian family. Christian families are characterized by the manifestation of the fruit of the Spirit, which includes love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, and self-control.\nAll members of your family must be encouraged to practice all the good virtues recorded in the Bible. Living a holy life pleases GOD so much and it presents you and your family as light in the midst of darkness of the world. Putting on seductive dresses, tattoo, artificial make-ups and the likes can’t make you and family different from ungodly family.\n\n10. Sharing the Gospel\nA strong Christian family knows that the mission given to them by Jesus Christ is to go out there to share the Gospel of salvation and not to waste their time in gatherings that are after their money. Use your social media platforms and the websites to share the Good News to people.\n\nI implore you to practice the ten qualities of a strong Christian family explained above consistently and I am sure you will contact me to share your wonderful testimonies about the strong love, joy and blessings from the LORD that will fill your household.\n",
    "family_site":"https://poweringrace.com/10-qualities-of-a-strong-christian-family-2/",
    "hymn_total": 5,
    "hymn_title1":"BLESSED ASSURANCE, JESUS IS MINE",
    "hymn_body1":"1. Blessed assurance, Jesus is mine;\nOh, what a foretaste of glory divine!\nHeir of salvation, purchase of God,\nBorn of His Spirit, washed in His blood.\n\nThis is my story, this is my song,\nPraising my Savior all the day long.\n\n2. Perfect submission, perfect delight,\nVisions of rapture now burst on my sight;\nAngels descending, bring from above\nEchoes of mercy, whispers of love.\n\nThis is my story, this is my song,\nPraising my Savior all the day long.\n\n3. Perfect submission, all is at rest,\nI in my Savior am happy and blest;\nWatching and waiting, looking above,\nFilled with His goodness, lost in His love.\n",
    "hymn_title2":"MY FAITH HAS FOUND A RESTING PLACE",
    "hymn_body2":"1.My faith has found a resting place,\nfrom guilt my soul is freed;\nI trust the ever-living One,\nhis wounds for me shall plead.\n\nI need no other argument,\nI need no other plea,\nit is enough that Jesus died,\nand that he died for me.\n\n2. Enough for me that Jesus saves,\nthis ends my fear and doubt;\na sinful soul, I come to him,\nhe’ll never cast me out.\n\nI need no other argument,\nI need no other plea,\nit is enough that Jesus died,\nand that he died for me.\n\n3. My heart is leaning on the Word,\nthe written Word of God,\nsalvation by my Savior’s name,\nsalvation thro' his blood.\n\nI need no other argument,\nI need no other plea,\nit is enough that Jesus died,\nand that he died for me.\n\n4. My great Physician heals the sick,\nthe lost he came to save;\nfor me his precious blood he shed,\nfor me his life he gave.\n",
    "hymn_title3":"JESUS KEEP ME NEAR THE CROSS",
    "hymn_body3":"1. Jesus, keep me near the cross,\nThere a precious fountain,\nFree to all—a healing stream,\nFlows from Calv’ry’s mountain.\n\nIn the cross, in the cross\nBe my glory ever,\nTill my ransomed soul shall find\nRest beyond the river. \n\n2. Near the cross, a trembling soul,\nLove and mercy found me;\nThere the Bright and Morning Star\nSheds its beams around me.\n\nIn the cross, in the cross\nBe my glory ever,\nTill my ransomed soul shall find\nRest beyond the river. \n\n3. Near the cross! O Lamb of God,\nBring its scenes before me;\nHelp me walk from day to day,\nWith its shadow o’er me.\n\nIn the cross, in the cross\nBe my glory ever,\nTill my ransomed soul shall find\nRest beyond the river. \n\n4. Near the cross! I'll watch and wait,\nHoping, trusting ever;\nTill I reach the golden strand,\nJust beyond the river\n",
    "hymn_title4":"HAVE YOU BEEN TO JESUS FOR THE CLEANSING POW’R?",
    "hymn_body4":"1. Have you been to Jesus for the cleansing pow’r?\nAre you washed in the blood of the Lamb?\nAre you fully trusting in His grace this hour?\nAre you washed in the blood of the Lamb?\n\nAre you washed in the blood,\nIn the soul-cleansing blood of the Lamb?\nAre your garments spotless?\nAre they white as snow?\nAre you washed in the blood of the Lamb?\n\n2. Are you walking daily by the Savior’s side?\nAre you washed in the blood of the Lamb?\nDo you rest each moment in the Crucified?\nAre you washed in the blood of the Lamb?\n\nAre you washed in the blood,\nIn the soul-cleansing blood of the Lamb?\nAre your garments spotless?\nAre they white as snow?\nAre you washed in the blood of the Lamb?\n\n3. When the Bridegroom cometh will your robes be white!\nAre you washed in the blood of the Lamb?\nWill your soul be ready for His presence bright,\nAnd be washed in the blood of the Lamb?\n\nAre you washed in the blood,\nIn the soul-cleansing blood of the Lamb?\nAre your garments spotless?\nAre they white as snow?\nAre you washed in the blood of the Lamb?\n\n4. Lay aside the garments that are stained with sin,\nAnd be washed in the blood of the Lamb;\nThere’s a fountain flowing for the soul unclean,\nO be washed in the blood of the Lamb.\n",
    "hymn_title5":"TIS SO SWEET TO TRUST IN JESUS",
    "hymn_body5":"1. Tis so sweet to trust in Jesus,\nJust to take Him at His word;\nJust to rest upon His promise;\nJust to know, Thus saith the Lord.\n\nJesus, Jesus, how I trust Him,\nHow I’ve proved Him o’er and o’er,\nJesus, Jesus, Precious Jesus!\nO for grace to trust Him more.\n\n2. O how sweet to trust in Jesus,\nJust to trust His cleansing blood;\nJust in simple faith to plunge me,\n’Neath the healing, cleansing flood.\n\nJesus, Jesus, how I trust Him,\nHow I’ve proved Him o’er and o’er,\nJesus, Jesus, Precious Jesus!\nO for grace to trust Him more.\n\n3. Yes, ’tis sweet to trust in Jesus,\nJust from sin and self to cease;\nJust from Jesus simply taking\nLife, and rest, and joy, and peace.\n\nJesus, Jesus, how I trust Him,\nHow I’ve proved Him o’er and o’er,\nJesus, Jesus, Precious Jesus!\nO for grace to trust Him more.\n\n4. I’m so glad I learned to trust Thee,\nPrecious Jesus, Savior, Friend;\nAnd I know that Thou art with me,\nWilt be with me to the end.\n",
    "hymn_tag":"][This is my story, this is my song][Praising my Savior all the day long][I need no other argument][I need no other plea][it is enough that Jesus died][and that he died for me][In the cross, in the cross][Be my glory ever][Till my ransomed soul shall find][Rest beyond the river][Jesus, Jesus, how I trust Him,][How I’ve proved Him o’er and o’er,][Jesus, Jesus, Precious Jesus!][O for grace to trust Him more][Are you washed in the blood,\nIn the soul-cleansing blood of the Lamb?\nAre your garments spotless?\nAre they white as snow?\nAre you washed in the blood of the Lamb?][",
    "home_tag":"][PRAYER][PASTOR TEMPLE ONYEKWENA][PICZ - HOSANNA PARISH][",
    "family_tag":"][How Does GOD Want a Strong Christian Family to Be?][What is Jesus Christ’s Teaching about the Christian Family?][5 Characteristics of a Strong Christian Family][10 Qualities of a Good Christian Family][1. No joke with the Prayer Altar][2. Quick to Forgive][3. Giving Room for Grace][4. Good Communication and Listening Attitude][5. Showing Unconditional Love][6. Unity and Teamwork][7. Prioritizes the Word of God][8. Wine and Dine Together][9. Produces Fruits of the Spirit][10. Sharing the Gospel]["
  },
  {
    "month":"8",
    "year":2024,
    "theme":"ALL POSSIBILITIES",
    "text":"Luke 1:37",
    "note":"“For with God nothing shall be impossible.” [KJV]",
    "home":"Praise be to our amazing God who has just brought us to a new beginning from the month of new things. August is the eighth month of the year. In the realm of the Spirit, eight represents new beginning. Rejoice for it’s a new season for you in the mighty name of Jesus.\n\n God’s word for us in this new month is coming from Luke 1:37, “For with God nothing shall be impossible”. Matthew’s rendition of the same scripture is more spot on. Matthew 19:26 says, “But Jesus beheld them, and said unto them, With men this is impossible; but with God all things are possible”. God is telling us in this month of August that with Him, nothing shall be impossible.\n\n Luke 1:37 was in reference to aged Elizabeth. As regards conception and childbirth, she was already written off. No one expected anything good to come out of Elizabeth. But the angel told Mary in the preceding verse that her barren cousin is now six months pregnant, a proof that there is nothing God cannot do.\n\n It doesn’t matter your situation. It doesn’t matter how long you’ve been sick, poor or experienced failure. If God could answer the prayers of Elizabeth, He will answer you. In the same vein, Mary was not expecting a child but received an August visitor in Angel Gabriel who announced to her: Hail Mary, you’ve favour with God and will bear a son.\n\n This month is therefore declared for us as a Church as our Month of all possibilities. If Elizabeth could carry a baby, if Mary without knowing any man could carry a baby, if God could make an axe-head float on the water, He can do anything. Your situation is not impossible for the Lord who made dry bones come back to life.\n\n This month of August serves as a reminder of God’s faithfulness in ushering us into a season of fresh starts and blessings. It is a time to reflect on the abundant grace and mercy bestowed upon us by our Heavenly Father.\n\n This month invites us to let go of past struggles and embrace a renewed sense of purpose and direction. It is an opportunity to realign ourselves with God’s plans and seek His guidance for the future.\n\n In the book of Jeremiah, we are reminded of God’s promise: Jeremiah 29: 11-This verse reassures us that even in times of uncertainty, God has a perfect plan for our lives.\n\n Crops reach maturity during the month of August, we can view this month as an opportunity for personal growth and spiritual maturity. It is a time to reflect on our journey of faith and seek a deeper relationship with God. we can trust that He will also meet our spiritual and physical needs. Matthew 6:26.\n\n As we embrace the spiritual significance of August, let us remember that it is not just a time to reap but also to sow, to be grateful for God’s provision, and to intentionally nurture our faith. May this month serve as a reminder of God’s goodness and encourage us to continue growing in His grace and love.\n\n We are encouraged to examine our lives and cultivate personal growth. It serves as a reminder to remain steadfast in our journey of faith, seeking God’s guidance and embracing His plans for our lives.\n\n One Bible verse that resonates with the biblical meaning of August is found in Philippians 4:19.\n\n This verse assures us that God’s provision is abundant and He will meet our needs abundantly.\n\n As we navigate through the month of August, let us remember to approach each day with gratitude and anticipation for the blessings that God has in store for us. Let us strive to be faithful stewards of the resources and opportunities He has given us, and trust in His divine timing and purposes.\n\n May this month be filled with abundant blessings, renewed hope, and strengthened faith as we align our lives with God’s will.\n\n Declare with all confidence that this is my month of all possibilities. There shall be no limitations in Jesus Christ name Amen.\n\n I declare that as you go in this month of August, the glory of God will go ahead of you. May the favour of God go ahead of you. You will see joy and celebrations. I declare limitless possibilities upon you. I bless you with the blessings of a priest. Go in this month of August and return with your testimonies. It is going to be a great month for you. AMEN.\n\n Finally, being Born again is your access to the God of all possibilities. If you will like to receive Jesus in your heart, Pls Pray: “Dear Lord Jesus, have mercy upon me a sinner, I am sorry for all my sins. I believe you died to save me. Pls be my Lord and savior henceforth in Jesus Name I pray”. Congratulations you are now a child of God. Pls reach out to us for follow up and endeavor to join the new believers’ class for teachings to help you grow. The class holds upstairs at the church gallery on Sundays by 8am. \n\n#HAPPYNEWMONTH. \n\nPASTOR TEMPLE ONYEKWENA\nPICZ- HOSANNA PARISH\n",
    "family_title":"KEEPING YOUR FAMILY STRONG IN TIMES OF SUFFERING",
    "family_text":"The older you become, the more you realize that trials and problems and even calamities are inevitable—they are a normal part of life. Things may be peaceful in your life right now, but be assured that, at some time, a storm will hit. It may be an accident, a health issue, a death in the family, or an unexpected financial problem.\n\n You cannot avoid the storms of life. But you can learn how to withstand them.\n Build your family upon God’s Word and upon daily prayer together. In Matthew 7, Jesus says that those who act upon His words are “like a wise man who built his house on the rock. And the rain fell, and the floods came, and the winds blew and beat on that house, but it did not fall, because it had been founded on the rock” (Matthew 7:24-25). As you make God and His Word the focus of your relationship and home, the trials and tribulations will strengthen rather than weaken your relationship. There are a number of things we need to do in order to stand strong when a storm hits:\n\n 1. We need to use times of trial and suffering as an opportunity to draw close to God.\n Nothing happens in our lives apart from what He allows or ordains. As 1 Chronicles 29:11 tells us, “Yours, O Lord, is the greatness and the power and the glory and the victory and the majesty, for all that is in the heavens and in the earth is yours. Yours is the kingdom, O Lord, and you are exalted as head above all.” Yet this same sovereign Lord also seeks a close relationship with us. As the following passages tell us, He is our Comforter during times of distress and suffering. Look at these verses:\n Psalm 34:18: “The Lord is near to the brokenhearted and saves the crushed in spirit.”\n Isaiah 41:10: “fear not, for I am with you; be not dismayed, for I am your God; I will strengthen you, I will help you, I will uphold you with my righteous right hand.”\n Psalm 23:4: Even though I walk through the valley of the shadow of death, I will fear no evil, for you are with me; your rod and your staff, they comfort me.”\n\n 2. We need to be there for each other when we’re dealing with suffering.\n A husband and wife must be involved with each other during a crisis. In the midst of the challenges couples should deliberately move closer to each other and communicate to understand the pain each one is going through.\n\n 3. We need to resolve to make our marriage a priority.\n Resolve that your marriage will remain solid through the situation. The children would feel stronger and more secure as well. Couples can schedule some time and get away and just be by themselves to talk with each other.\n\n 4. We need to allow the body of Christ to minister to us.\n Involve trusted brethren and confidants; share the challenges and seek prayers, support and counselling. This helps to reassure that other people care.\n\n 5. We need to learn to hold to the truth of God’s Word no matter what our emotions tell us.\n We can’t deny our emotions, but we can’t allow them to control our responses, either. We’ve got to hang on to the truth of Scripture and let that be the foundation of our home.\n\n Even when we don’t feel that God loves us, we know from Scriptures that He does. When we don’t feel like any good can come out of a trial or calamity, we know from Romans 8:28 that all things really do “work together for good, for those who are called according to his purpose.”\n",
    "family_site":"https://www.theraineys.org",
    "hymn_total": 4,
    "hymn_title1":"O WORSHIP THE KING ALL GLORIOUS ABOVE!",
    "hymn_body1":"1. O worship the King all-glorious above,\n O gratefully sing his power and his love:\n our shield and defender, the Ancient of Days,\n pavilioned in splendor and girded with praise.\n\n 2. O tell of his might and sing of his grace,\n whose robe is the light, whose canopy space.\n His chariots of wrath the deep thunderclouds form,\n and dark is his path on the wings of the storm.\n\n 3. Your bountiful care, what tongue can recite?\n It breathes in the air, it shines in the light;\n it streams from the hills, it descends to the plain,\n and sweetly distills in the dew and the rain.\n\n 4. Frail children of dust, and feeble as frail,\n in you do we trust, nor find you to fail.\n Your mercies, how tender, how firm to the end,\n our Maker, Defender, Redeemer, and Friend!\n\n 5. O measureless Might, unchangeable Love,\n whom angels delight to worship above!\n Your ransomed creation, with glory ablaze,\n in true adoration shall sing to your praise!\n",
    "hymn_title2":"STANDING ON THE PROMISES OF CHRIST, MY KING",
    "hymn_body2":"1. Standing on the promises of Christ, my King,\nThrough eternal ages let his praises ring;\nGlory in the highest, I will shout and sing,\nStanding on the promises of God. \n\nStanding, standing,\nStanding on the promises of God, my Savior;\nStanding, standing,\nI'm standing on the promises of God.\n\n2. Standing on the promises that cannot fail.\nWhen the howling storms of doubt and fear assail,\nBy the living Word of God I shall prevail,\nStanding on the promises of God.\n\nStanding, standing,\nStanding on the promises of God, my Savior;\nStanding, standing,\nI'm standing on the promises of God.\n\n3. Standing on the promises of Christ, the Lord,\nBound to him eternally by love's strong cord,\nOvercoming daily with the Spirit's sword,\nStanding on the promises of God.\n\nStanding, standing,\nStanding on the promises of God, my Savior;\nStanding, standing,\nI'm standing on the promises of God.\n\n4. Standing on the promises I cannot fall,\nList'ning ev'ry moment to the Spirit's call,\nResting in my Savior as my all in all,\nStanding on the promises of God.\n",
    "hymn_title3":"WHAT A FRIEND WE HAVE IN JESUS",
    "hymn_body3":"1. What a friend we have in Jesus,\nall our sins and griefs to bear!\nWhat a privilege to carry\neverything to God in prayer!\n\nO what peace we often forfeit,\n O what needless pain we bear,\nall because we do not carry\neverything to God in prayer!\n\n2. Have we trials and temptations?\nIs there trouble anywhere?\nWe should never be discouraged;\ntake it to the Lord in prayer!\n\nCan we find a friend so faithful\nwho will all our sorrows share?\nJesus knows our every weakness;\ntake it to the Lord in prayer!\n\n3. Are we weak and heavy laden,\ncumbered with a load of care?\nPrecious Savior, still our refuge\ntake it to the Lord in prayer!\n\nDo your friends despise, forsake you?\nTake it to the Lord in prayer!\nIn his arms he'll take and shield you;\nyou will find a solace there.\n",
    "hymn_title4":"ROCK OF AGES, CLEFT FOR ME",
    "hymn_body4":"1. Rock of Ages, cleft for me,\nLet me hide myself in Thee;\nLet the water and the blood,\nFrom Thy riven side which flowed,\nBe of sin the double cure,\nSave me from its guilt and power.\n\n2. Not the labor of my hands\nCan fulfill Thy law’s demands;\nCould my zeal no respite know,\nCould my tears forever flow,\nAll for sin could not atone;\nthou must save, and thou alone.\n\n3. Nothing in my hand I bring,\n simply to the cross I cling;\nnaked, come to thee for dress;\nhelpless, look to thee for grace;\nfoul, I to the fountain fly;\nwash me, Savior, or I die.\n\n4. While I draw this fleeting breath,\nwhen mine eyes shall close in death,\nwhen I soar to worlds unknown,\nsee thee on thy judgment throne,\nRock of Ages, cleft for me,\nlet me hide myself in thee.\n",
    "hymn_tag":"][Standing, standing,][Standing on the promises of God, my Savior;][I'm standing on the promises of God.][",
    "home_tag":"][Luke 1:37][all possibilities][Jeremiah 29: 11][Matthew 6:26][Philippians 4:19][AMEN][PASTOR TEMPLE ONYEKWENA][PICZ- HOSANNA PARISH][",
    "family_tag":"][1. We need to use times of trial and suffering as an opportunity to draw close to God.][2. We need to be there for each other when we’re dealing with suffering.][3. We need to resolve to make our marriage a priority.][4. We need to allow the body of Christ to minister to us.][5. We need to learn to hold to the truth of God’s Word no matter what our emotions tell us.]["
  },
  {
    "month":"7",
    "year":2024,
    "theme":"DIVINE PERFECTION",
    "text":"2 Kings 5:1-14",
    "note":"“Now Naaman, captain of the host of the king of Syria, was a great man with his master, and honourable, because by him the Lord had given deliverance unto Syria: he was also a mighty man in valour, but he was a leper. And the Syrians had gone out by companies, and had brought away captive out of the land of Israel a little maid; and she waited on Naaman's wife. And she said unto her mistress, Would God my lord were with the prophet that is in Samaria! for he would recover him of his leprosy. And one went in, and told his lord, saying, Thus and thus said the maid that is of the land of Israel. And the king of Syria said, Go to, go, and I will send a letter unto the king of Israel. And he departed, and took with him ten talents of silver, and six thousand pieces of gold, and ten changes of raiment. And he brought the letter to the king of Israel, saying, Now when this letter is come unto thee, behold, I have therewith sent Naaman my servant to thee, that thou mayest recover him of his leprosy. And it came to pass, when the king of Israel had read the letter, that he rent his clothes, and said, Am I God, to kill and to make alive, that this man doth send unto me to recover a man of his leprosy? wherefore consider, I pray you, and see how he seeketh a quarrel against me. And it was so, when Elisha the man of God had heard that the king of Israel had rent his clothes, that he sent to the king, saying, Wherefore hast thou rent thy clothes? let him come now to me, and he shall know that there is a prophet in Israel. So Naaman came with his horses and with his chariot, and stood at the door of the house of Elisha. And Elisha sent a messenger unto him, saying, Go and wash in Jordan seven times, and thy flesh shall come again to thee, and thou shalt be clean. But Naaman was wroth, and went away, and said, Behold, I thought, He will surely come out to me, and stand, and call on the name of the Lord his God, and strike his hand over the place, and recover the leper. Are not Abana and Pharpar, rivers of Damascus, better than all the waters of Israel? may I not wash in them, and be clean? So he turned and went away in a rage. And his servants came near, and spake unto him, and said, My father, if the prophet had bid thee do some great thing, wouldest thou not have done it? how much rather then, when he saith to thee, Wash, and be clean? Then went he down, and dipped himself seven times in Jordan, according to the saying of the man of God: and his flesh came again like unto the flesh of a little child, and he was clean.” [KJV]",
    "home":"Philippians 1:6: Being confident of this very thing, that he which hath begun a good work in you will perform it until the day of Jesus Christ.\n Number seven is a very significant number in the Bible which represents perfection. When you search the Scriptures, you would find out that seven is very prevalence. For instance, in Genesis 8, after the water prevailed upon the earth for hundred and fifty days, God finally remembered Noah on the seventh month and the ark rested upon the mountains of Ararat. For the wall of Jericho to fall down flat, it took seven priests with seven trumpet ram’s horns to prevailed. (Joshua 6). In the seventh month, God always perform unusual miracles, stubborn situation are dealt with, covenants are fulfilled and new ones are enacted.\n\n In our Bible reading, prophet Elisha asked general Naaman to “go and wash in Jordan seven times, and thy flesh shall come again to thee, and thou shalt be clean”. And when Naaman did, a miracle happened. And his flesh came again like unto the flesh of a little child, and he was clean.\n\n 1. Naaman was described as a great man and an honourable man. He was a successful general who had even prevailed over Israel. The bible also called him a mighty man of valour, but he was a leper. A great man is someone who is notable, remarkable or exceptionally outstanding. In spite of all that Naaman had achieved, he had a “but” in his life. In spite of all the achievements of Naaman he was a leper. You hear things like he made a first class but he has been jobless for over 5years. She is very beautiful but no man is interested in marrying her. Successful but childless. Hardworking but always overlooked during promotion. The ‘but’ in the life of Naaman was causing him sorrow, shame and disgrace.\n\n 2. In 1Corin 1:25 Because the foolishness of God is wiser than man; and the weakness of God is stronger than men.\n Ecc 8:17: Then I beheld all the work of God, that a man cannot find out the work that is done under the sun; because though a man labour to seek it out, yet he shall not find it; yea further; though a wise man think to know it, yet shall he not be able to find it. How come the little maid from the land of Israel who knew about Elisha was serving in the home of Naaman? How come the butler and the baker were locked in the same prison as Joseph? How come they dreamt while in prison and Joseph was there to interpret their dreams? How come Moses was raised in the home of Pharaoh by his daughter after he had commanded all the Hebrew boys to be killed? How come Jonathan the heir apparent to the throne was the one shielding David from his father? We cannot fully figure out God. Are you planning to lose hope or commit suicide? Don’t. Do not cooperate with Satan. It is not over for as long as you are alive.\n Joseph told his brothers in Gen 50:20 that what they meant for evil, God turned it around for his good. That will be your story in Jesus name.\n\n 3. Naaman approached the king of Syria to reach out to the king of Israel on his b behalf. V6: And he brought the letter to the king of Israel, saying, Now when this letter is come unto thee, behold, I have therewith sent Naaman my servant to thee, that thou mayest recover him of his leprosy.\n The letter was saying I understand you guys have a cure in Israel, ensure Naaman is treated. Some letters must be treated with dispatch. The king of Israel panicked. The word went round quickly until Elisha heard about it and asked that Naaman should be brought to him.\n For someone reading this, the word of the King of Kings has gone out that all your delayed, denied, diverted and stolen property should be restored to you.\n Your letter of promotion has been signed. Your contract letter has been issued. Your entitlement will be released to you this month in Jesus Christ name amen.\n\n 4. James 4:6 But he giveth more grace. Wherefore he saith, God resisteth the proud, but giveth grace unto the humble.\n In Esther 1:10-19, Vashti out of pride refused the husband’s instruction and lost her place in the palace. In our text, Naaman was about to lose his breakthrough due to anger and pride. V13: “And his servant came near and spake unto him, and said, My Father, if the prophet had bid thee do some great thing, wouldest thou not have done it? How much rather then, when he saith to thee, wash, and be clean?” Notice this is the second time his servants intervened in the life of their master. They called him Father!! Prov 11:2 When pride cometh, then cometh shame; but with the lowly is wisdom. Prov 16:18 goeth before destruction, and an haughty spirit before a fall.\n\n 5. V14 So he did it. He went down and immersed himself in the Jordan seven times, following the orders of the Holy man. His skin was healed; it was like the skin of a little baby. He was as good as new. (Message Bible).\n\n God wants to restore someone in this month.\n In this regard, I am so confident that in this seventh month of Divine Perfection, \n* Your divine healing shall be perfected \n* Your pregnancy shall be perfected because there shall be no more miscarriage \n* The Lord shall perfect all that concerns you and your household \n* Everything you’ve lost shall be totally restored \n* Every closed doors shall swing open on their own accord \n* Everything you shall touch shall prosper \n* The Lord will fight all your battles and you shall hold your peace \n* Mercy and grace shall speak on your behalf. And finally, being Born again is the first step to experiencing supernatural visitation. \nIf you will like to receive Jesus in your heart, Pls Pray: “Dear Lord Jesus, have mercy upon me a sinner, I am sorry for all my sins. I believe you died to save me. Please be my Lord and savior henceforth in Jesus Name I pray”. Congratulations you are now a child of God.\n Please reach out to us for follow-up and endeavour to join the new believers’ class for teachings to help you grow. The class is held upstairs at the church gallery every Sunday at 8am.\n God Almighty shall give you triple DIVINE PERFECTION in Jesus Mighty Name.\n #HAPPYNEWMONTH. \n\nPASTOR TEMPLE ONYEKWENA\nPICZ- HOSANNA PARISH\n",
    "family_title":"ISOLATION: ENEMY NUMBER ONE OF YOUR MARRIAGE",
    "family_text":"If there’s one thing worse than a miserable, lonely single person, it’s a miserable, lonely married person. The irony is that no husband or wife marries with the intention of being isolated from their spouse. Most people believe that marriage is the cure for loneliness, but I want to warn you: You began battling the dreaded foe of isolation as soon as you drove off on your honeymoon. Isolation has reached epidemic proportions in the most intimate of human relationships. It not only leads to divorce, but it also saps the strength from millions of marriages that still appear intact.\n\n I believe that isolation is Satan’s chief strategy for destroying relationships, especially marriage. It is the number one enemy of your marriage. Like a terminal virus, isolation invades marriages silently, slowly, and painlessly at first. By the time you become aware of its insidious effects, it can be too late. Your marriage can be disabled by boredom and apathy, and even die from emotional malnutrition and relational neglect.\n\n What is isolation?\n The dictionary will tell you that isolation is “the condition of being alone separated, solitary, set apart,” but I like what our daughter Ashley said once when she slipped into my study to ask me what I was writing about. “Isolation,” I explained. “Do you know what that means?” “Oh,” our 10-year-old replied, “that’s when somebody excludes you.”\n\n When isolation infects a marriage, a husband and a wife exclude each other. When you’re excluded, you have a feeling of distance, a lack of closeness, and little real intimacy. You can share a bed, eat at the same dinner table, watch the same TV,  parent the same children—and still be alone. You may have sex, but you don’t have love. Talk, but you don’t communicate. Live together without sharing life. Because of the alarming number of couples in good marriages who are unaware of this problem, I must state forcefully a sobering truth: Every marriage will naturally move toward a state of isolation. Unless you lovingly and energetically nurture and maintain intimacy in your marriage, you will drift apart from your spouse. It’s as inevitable as gravity, and if you aren’t purposefully trying to defeat it, isolation will win. And that’s a tragedy, because the soul was not created to live solo. We yearn for intimacy, and marriage is where we hope we’ll find it. The tragedy is that few couples succeed in achieving it and maintain it in their lifelong journey.\n\n Telltale signs of isolation\n Isolation starts when husband and wife slowly drift apart in ways they may not recognize at first. Signs include the following:\n \n· Feeling that your spouse isn’t hearing you and doesn’t understand. \n· Feeling unappreciated. \n· Feeling unable to please or meet the expectations of your spouse. \n· Sensing that he’s detached from you. \n· Feeling that she’s going her own way. \n· Refusing to cope with reality: “That’s your problem, not mine.” \n· Keeping the peace to avoid the conflict rather than experiencing the pain of dealing with reality. \n· Attitudes of, “Who cares?” “Why try?” “Tomorrow we’ll talk about it—let’s just get some sleep.”\n\n Couples will present a happy facade, keeping house and playing at marriage while real needs go unmet. Unmet needs indicate the presence of isolation in a marriage, and slipping into a state of isolation may seem to offer protection and self-preservation. Although silence feels like a security blanket, it is perilously deceptive. Many marriages continue for years in a state of armed truce. Competition replaces cooperation, and ugly reality dashes the dreams of hope as conflict unravels the fabric of love and concern. Broken hearts stain pillows with bitter tears.\n\n The choice is yours\n Every day, each spouse in a marriage makes choices that result in oneness or in isolation. May I recommend three important choices you need to make?\n\n Choice #1: Resolve to pursue oneness with each other, and repent of any isolation that already exists in your marriage.\n Remember, you don’t have to be married a long time to be isolated.  Don’t allow isolation to take up every day residence in your home.\n\n Choice #2: Resolve never to go to bed angry with each other.\n Find a way to resolve your differences and move toward oneness. Realize that often it’s easier to hold a grudge than to forgive. Resentment and oneness cannot coexist.\n\n Choice #3: Resolve to take time to share intimately with each other.\n Allow your spouse into your life. Ask questions of your spouse and listen patiently. Learn the art of healthy, transparent communication.\n\n I can hear someone asking, “What if we’re already in deep trouble?” Swallow your pride. Get help, Divine help. Psalm 127:1 reminds us, “Unless the Lord builds the house, they labor in vain who build it.” Cry out to God and ask Him to rescue your marriage. I would even suggest something that may feel unthinkable: Ask your spouse to pray with you for God to do a work in both of your hearts and redeem your relationship.\n\n Second, call a friend in your church who has a solid marriage and ask them for help. Or call your pastor and ask if he knows a couple who could mentor you and your spouse. Make the right choices, and you’ll know love, warmth, acceptance, and the freedom of true intimacy and genuine oneness as husband and wife. Make the wrong choices, and you’ll know the quiet desperation of living together but never really touching each other deeply. We were not meant to be alone in the most intimate human relationship God created. Choose today to move away from the chill of isolation and toward warmth in each other.  You’ll be glad you did.\n",
    "family_site":"https://www.theraineys.org",
    "hymn_total": 4,
    "hymn_title1":"PRAISE TO THE LORD, THE ALMIGHTY",
    "hymn_body1":"1. Praise to the Lord, the Almighty, the King of creation!\n O my soul, praise Him, for He is thy health and salvation!\n All ye who hear, Now to His temple draw near;\n Sing now in glad adoration!\n\n 2.Praise to the Lord, who o’er all things so wondrously reigneth,\n Who, as on wings of an eagle, uplifteth, sustaineth.\n Hast thou not seen How thy desires all have been\n Granted in what He ordaineth?\n\n 3. Praise to the Lord, who hath fearfully, wondrously, made thee!\n Health hath vouchsafed and, when heedlessly falling, hath stayed thee.\n What need or grief Ever hath failed of relief?\n Wings of His mercy did shade thee.\n\n 4. Praise to the Lord, who doth prosper thy work and defend thee,\n Who from the heavens the streams of His mercy doth send thee.\n Ponder anew What the Almighty can do,\n Who with His love doth befriend thee.\n\n 5. Praise to the Lord! Oh, let all that is in me adore Him!\n All that hath life and breath, come now with praises before Him!\n Let the Amen Sound from His people again;\n Gladly for aye we adore Him.\n",
    "hymn_title2":"THOU MY EVERLASTING PORTION",
    "hymn_body2":"1. Thou my everlasting Portion,\n More than friend or life to me,\n All along my pilgrim journey,\n Savior, let me walk with Thee.\n\n CHORUS\n Close to Thee, close to Thee,\n Close to Thee, close to Thee;\n All along my pilgrim journey,\n Savior, let me walk with Thee.\n\n 2. Not for ease or worldly pleasure,\n Not for fame my prayer shall be;\n Gladly will I toil and suffer,\n Only let me walk with Thee.\n\n CHORUS\n Close to Thee, close to Thee,\n Close to Thee, close to Thee;\n Gladly will I toil and suffer,\n Only let me walk with Thee.\n\n 3. Lead me through the vale of shadows,\n Bear me o’er life’s fitful sea;\n Then the gate of life eternal\n May I enter, Lord, with Thee.\n\n CHORUS\n Close to Thee, close to Thee,\n Close to Thee, close to Thee;\n Then the gate of life eternal\n May I enter, Lord, with Thee.\n",
    "hymn_title3":"TAKE MY LIFE, AND LET IT BE",
    "hymn_body3":"1. Take my life, and let it be\n Consecrated, Lord, to Thee;\n Take my moments and my days,\n Let them flow in ceaseless praise,\n Let them flow in ceaseless praise.\n\n 2. Take my hands, and let them move\n At the impulse of Thy love;\n Take my feet and let them be\n Swift and beautiful for Thee,\n Swift and beautiful for Thee.\n\n 3. Take my voice, and let me sing\n Always, only, for my King;\n Take my lips, and let them be\n Filled with messages from Thee,\n Filled with messages from Thee.\n\n 4. Take my silver and my gold;\n Not a mite would I withhold;\n Take my intellect, and use\n Every power as Thou shalt choose,\n Every power as Thou shalt choose.\n\n 5. Take my will, and make it Thine;\n It shall be no longer mine.\n Take my heart; it is Thine own;\n It shall be Thy royal throne,\n It shall be Thy royal throne.\n\n 6. Take my love; my Lord, I pour\n At Thy feet its treasure-store.\n Take myself, and I will be\n Ever, only, all for Thee,\n Ever, only, all for Thee.\n",
    "hymn_title4":"IN CHRIST ALONE",
    "hymn_body4":"1. In Christ alone, my hope is found\n He is my light, my strength, my song\n This Cornerstone, this solid ground\n Firm through the fiercest drought and storm\n What heights of love, what depths of peace\n When fears are stilled, when strivings cease\n My Comforter, my All in All\n Here in the love of Christ I stand\n\n 2. In Christ alone, who took on flesh\n Fullness of God in helpless babe\n This gift of love and righteousness\n Scorned by the ones He came to save\n 'Til on that cross as Jesus died\n The wrath of God was satisfied\n For every sin on Him was laid\n Here in the death of Christ I live, I live\n\n 3. There in the ground His body lay\n Light of the world by darkness slain\n Then bursting forth in glorious Day\n Up from the grave He rose again\n And as He stands in victory\n Sin's curse has lost its grip on me\n For I am His and He is mine\n Bought with the precious blood of Christ\n\n 4. No guilt in life, no fear in death\n This is the power of Christ in me\n From life's first cry to final breath\n Jesus commands my destiny\n No power of hell, no scheme of man\n Can ever pluck me from His hand\n Till He returns or calls me home\n Here in the power of Christ I'll stand.\n",
    "hymn_tag":"][CHORUS][Close to Thee, close to Thee,\n Close to Thee, close to Thee;\n All along my pilgrim journey,\n Savior, let me walk with Thee.][Close to Thee, close to Thee,\n Close to Thee, close to Thee;\n Gladly will I toil and suffer,\n Only let me walk with Thee.\n\n][Close to Thee, close to Thee,\n Close to Thee, close to Thee;\n Then the gate of life eternal\n May I enter, Lord, with Thee.][",
    "home_tag":"][Philippians 1:6:][Genesis 8,][(Joshua 6)][1Corin 1:25][Ecc 8:17:][Gen 50:20][V6:][James 4:6][Esther 1:10-19][V13:][Prov 11:2][Prov 16:18][V14][God wants to restore someone in this month][Hosanna Parish][PASTOR TEMPLE ONYEKWENA][PICZ- HOSANNA PARISH][",
    "family_tag":"][What is isolation?][Telltale signs of isolation][The choice is yours][Choice #1: Resolve to pursue oneness with each other, and repent of any isolation that already exists in your marriage.][Choice #2: Resolve never to go to bed angry with each other.][Choice #3: Resolve to take time to share intimately with each other.]["
  },
  {
    "month":"6",
    "year":2024,
    "theme":"SUPERNATURAL VISITATION",
    "text":"Genesis 21:1",
    "note":"“And the Lord visited Sarah as he had said, and the Lord did unto Sarah as he had spoken.” [KJV]",
    "home":"And the Lord visited Sarah as he had said, and the Lord did unto Sarah as he had spoken. (Genesis 21:1) \n\nOur text is one of the most promising records of the faithfulness of God and the respect that God has for His own word. In Isaiah 55:11, God made it clear that “so is my word that goes out from my mouth: It will not return to me empty, but will accomplish what I desire and achieve the purpose for which I sent it” (NLT). What can we learn from this passage? The fact is that even if the promise of God has not yet been fulfilled at the moment, it will surely come to pass at the appointed time. As the bible enjoined, all you need is to wait for the manifestation. While waiting, continue to praise Him as a sign of faith in His ability to bring His promises to performance in your life. We can see many evidences in the bible and in our generation that show that those that wait on His promises have never been disappointed nor put to shame. You would not be put to shame as you wait on Him in Jesus' name. \n\nGod has proved Himself faithful in our mist in the past five months. We experienced tremendous blessings and deliverances in all ramifications. The covenant keeper kept His covenant over us for which we return all the glory to Him. In this sixth month, God has promised to visit us supernaturally and change our story for good in Jesus name. Whenever God visits any situation supernaturally, natural laws are suspended and supernatural laws take over immediately. \n\nIn the sixth month, the angel of the Lord visited Mary, and a virgin lady conceived by the power of the Holy Spirit and later delivered the messiah of the whole world. This is a miracle that has never happened before in the history of mankind. The natural law of conception was suspended because there was a supernatural visitation from the throne of grace. \n\nI decree and I prophesy that every natural law that is in operation in your life that has hindered your total freedom will be supernaturally suspended this month because of the supernatural visitation that you will experience in Jesus' name. Amen \n\nThe Bible says in Hab.2:3 “This vision is for a future time. It describes the end, and it will be fulfilled. If it seems slow in coming, wait patiently, for it will surely take place. It will not be delayed” (NLT). Habakkuk is very clear about how God works. It may appear that He is delaying but in most cases, any delay is for a purpose. A lot of time, such delays would work in your favour as it may prevent you from destruction. The Bible provides answer to why God may appear to be delaying. In 2 Pet. 3:9 God says that “The Lord is not slow in keeping His promise, as some understand slowness. He is patient with you, not wanting anyone to perish, but everyone to come to repentance (NIV). This means that the Lord may delay His visitation to test your level of faith, obedience and love for Him rather than what you can get from Him. Job is a very popular example of a man whose walk with God was not dependent on what he could get from God. He was emphatic in Job 13:15, where he states “Though he slay me, yet will I trust in him: but I will maintain mine own ways before him” (KJV). Can you confidently say the same? When you get to the level where you can declare to the world that you are not moved by what you see, then you have made yourself a candidate for supernatural visitation. \n\nI pray that the Lord would impress into your heart a desire and a passion for Him that would cause you to attract His supernatural visitation in Jesus' name. I hope one of us in Hosanna Parish would go to God and say “Father, increase my faith”. As many as would sincerely say this prayer, the Lord would hear you and do unto you according to your heart’s desire in Jesus' name. You would be divinely visited. Be ready for a new season and a change of story. Laughter (Isaac) was the result of Sarah’s supernatural visitation. Divine laughter shall surely be your portion in this sixth month of Supernatural Visitation in Jesus' name. You shall surely be the next to testify in Jesus' name. \n\nFinally, being Born again is the first step to experiencing supernatural visitation. If you would like to receive Jesus in your heart, Pls Pray: “Dear Lord Jesus, have mercy upon me a sinner, I am sorry for all my sins. I believe you died to save me. Pls be my Lord and saviour henceforth in Jesus Name I pray”. Congratulations you are now a child of God. Pls reach out to us for follow-up and endeavour to join the new believers’ class for teachings to help you grow. The class is held upstairs at the church gallery every Sunday at 8am.\n\nPASTOR TEMPLE ONYEKWENA\nPICZ- HOSANNA PARISH\n",
    "family_title":"3 NECESSITIES FOR A ‘ONENESS MARRIAGE’",
    "family_text":"A oneness marriage is formed by a husband and wife who are grafting intimacy, trust, and understanding with one another. It’s a couple chiseling out a common direction, purpose, and plan. A oneness marriage demands a lifetime process of relying on God and forging an enduring relationship according to His design. It’s more than a mere mingling of two humans—it’s a tender merger of body, soul, and spirit. \n\nOneness in marriage is like a pair of scissors: two components joined, never to be separated. Scissor blades frequently go in different directions, but they are most powerful when coming together. \n\nKing Solomon spoke of the mortar of the marriage merger: “By wisdom a house is built, and by understanding it is established; and by knowledge the rooms are filled with all precious and pleasant riches” (Proverbs 24:3-4, emphasis added). \n\nNote the results when a marriage is built, established, and filled according to God’s plan: There’s no room in this house for isolation—it’s been renovated and firmly fixed. The richness of its value and the pleasure of its enjoyment fills every room. This is a portrait of what it means to be one with your spouse. \n\nHere are three foundational components of a oneness marriage: \n\n1. A oneness marriage needs to grow in wisdom. \nWisdom is skillfully living life God’s way.  It means that we respond to circumstances according to God’s design. A wise homebuilder recognizes God as the Architect and Builder of marriages. As we ask God for wisdom and search the Scriptures, He supplies the skill to build our home. \n\nOne of the most critical issues a husband and wife must settle in their life together is: Who will be the builder of our marriage? \n\nKing David warned, “Unless the Lord builds the house, those who build it labor in vain.” (Psalm 127:1). For many, the architect and builder of the marriage is “self.” It’s no wonder so many marriages fail. \n\n2. A oneness marriage needs understanding. \nUnderstanding means looking at life’s circumstances with insight—a perspective that looks at life through God’s eyes. Understanding your spouse from God’s perspective results in acceptance of his or her differences and beginning to learn how God made that person to complement you. Understanding produces compassion for your spouse. It will give you insight to lead wisely or to follow prudently. \n\nA husband and wife in their thirties told me how they finally understood the way their differences complemented one another. The husband explained, “My wife is a prosecuting attorney. I felt like she prosecuted from 8:00 to 5:00 and persecuted me from 5:00 to 8:00! In the year and a half we have been married I found out she is a strong woman. I had hoped I could pressure her to change—if I persevered, I might be able to beat her down. But I have finally understood that I don’t have to compete with her. I can let her be who she is, and not give in to feelings of insecurity about who I am.” \n\nWhat that husband found was an understanding of how he and his wife balanced and complimented one another. He realized he could lead her even though she might challenge him at times, and that it was good for him. Understanding builds oneness by establishing the relationship on a foundation of common insight: God made us and brought us together for one another. \n\n3. A oneness marriage needs knowledge. \nMany couples get married with little knowledge of practically how to build a marriage according to God’s design. This is increasingly common in our culture today, with many people growing up in broken families and without any familiarity with the Scriptures. Marriage is central to God’s purposes for humankind, and the Bible is full of instruction about God’s purposes for marriage and how to build a love that lasts a lifetime. God’s Word is the source of the wisdom, understanding, and knowledge. \n\nYou can have a oneness marriage \nIn your journey of marriage, you likely started by wanting the best, and thoughts of becoming isolated and lonely never entered your mind. You were probably quite sure that your marriage would not be affected by disillusionment or mediocrity. \n\nNow, perhaps, symptoms of isolation are becoming apparent, or you may realize you have been living with it for years. The good news is that isolation can be defeated. Its disease can be cured if you are willing to make the right choices and then put the necessary effort into building oneness.\n",
    "family_site":"https://www.theraineys.org",
    "hymn_total": 5,
    "hymn_title1":"GREAT IS THY FAITHFULNESS",
    "hymn_body1":"1. Great is Thy faithfulness, O God my Father;\nthere is no shadow of turning with Thee;\nThou changest not, Thy compassions, they fail not;\nas Thou hast been, Thou forever wilt be.\n\nGreat is Thy faithfulness!\nGreat is Thy faithfulness!\nMorning by morning new mercies I see;\nall I have needed Thy hand hath provided:\ngreat is Thy faithfulness, Lord, unto me!\n\n2. Summer and winter, and springtime and harvest;\nsun, moon, and stars in their courses above\njoin with all nature in manifold witness\nto Thy great faithfulness, mercy, and love.\n\nGreat is Thy faithfulness!\nGreat is Thy faithfulness!\nMorning by morning new mercies I see;\nall I have needed Thy hand hath provided:\ngreat is Thy faithfulness, Lord, unto me!\n\n3. Pardon for sin and a peace that endureth,\nThine own dear presence to cheer and to guide;\nstrength for today and bright hope for tomorrow:\nblessings all mine, with ten thousand beside!\n\nGreat is Thy faithfulness!\nGreat is Thy faithfulness!\nMorning by morning new mercies I see;\nall I have needed Thy hand hath provided:\ngreat is Thy faithfulness, Lord, unto me!\n",
    "hymn_title2":"IT IS WELL WITH MY SOUL",
    "hymn_body2":"1. When peace like a river attendeth my way, \nwhen sorrows like sea billows roll; \nwhatever my lot, thou hast taught me to say, \n\"It is well, it is well with my soul.\" \n\nIt is well with my soul; \nit is well, it is well with my soul. \n\n2. Though Satan should buffet, though trials should come, \nlet this blest assurance control: \nthat Christ has regarded my helpless estate, \nand has shed his own blood for my soul. Refrain \n\nIt is well with my soul; \nit is well, it is well with my soul. \n\n3. My sin oh, the bliss of this glorious thought! \nmy sin, not in part, but the whole, \nis nailed to the cross, and I bear it no more; \npraise the Lord, praise the Lord, O my soul! Refrain \n\nIt is well with my soul; \nit is well, it is well with my soul. \n\n4. O Lord, haste the day when my faith shall be sight, \nthe clouds be rolled back as a scroll; \nthe trump shall resound and the Lord shall descend; \neven so, it is well with my soul. Refrain \n\nIt is well with my soul; \nit is well, it is well with my soul.\n",
    "hymn_title3":"HEAVENS CAME DOWN",
    "hymn_body3":"1. O what a wonderful wonderful day \nDay I will never forget \nAfter I'd wandered in darkness away \nJesus my Savior I met \nO what a tender compassionate friend \nHe met the need of my heart \nShadows dispelling with joy I am telling \nHe made all the darkness depart \n\nHeaven came down and glory filled my soul \nWhen at the cross the Savior made me whole \nMy sins were washed away \nAnd my night was turned to day \nHeaven came down and glory filled my soul \n\n2. Born of the Spirit with life from above \nInto God's fam'ly divine \nJustified fully through Calvary's love \nO what a standing is mine \nAnd the transaction so quickly was made \nWhen as a sinner I came \nTook of the offer of grace \nHe did proffer He saved me \nO praise His dear name \n\nHeaven came down and glory filled my soul \nWhen at the cross the Savior made me whole \nMy sins were washed away \nAnd my night was turned to day \nHeaven came down and glory filled my soul \n\n3. Now I've a hope that will surely endure \nAfter the passing of time \nI have a future in heaven for sure \nThere in those mansions sublime \nAnd it's because of that wonderful day \nWhen at the cross I believed \nRiches eternal and blessings supernal \nFrom His precious hand I received \n\nHeaven came down and glory filled my soul \nWhen at the cross the Savior made me whole \nMy sins were washed away \nAnd my night was turned to day \nHeaven came down and glory filled my soul\n",
    "hymn_title4":"I'VE ANCHORED IN JESUS",
    "hymn_body4":"1. Upon life's boundless ocean where mighty billows roll, \nI've fixed my hope in Jesus, blest anchor of my soul; \nWhen trials fierce assail me as storms are gath'ring o'er, \nI rest upon His mercy and trust Him more. \n\nI've anchored in Jesus, The storms of life I'll brave, \nI've anchored in Jesus, I fear no wind or wave, \nI've anchored in Jesus for he hath pow'r to save, \nI've anchored in the Rock of Ages. \n\n2. He keeps my soul from evil and gives me blessed peace, \nHis voice hath stilled the waters and bid their tumult cease; \nMy Pilot and Deliv'rer, to Him I all confide, \nFor always when I need Him, He's at my side. \n\nI've anchored in Jesus, The storms of life I'll brave, \nI've anchored in Jesus, I fear no wind or wave, \nI've anchored in Jesus for he hath pow'r to save, \nI've anchored in the Rock of Ages. \n\n3. He is my Friend and Saviour, in him my anchor's cast. \nHe drives away my sorrows and shields me from the blast; \nBy faith I'm looking upward beyond life's troubled sea, \nThere I behold a haven prepared for me. \n\nI've anchored in Jesus, The storms of life I'll brave, \nI've anchored in Jesus, I fear no wind or wave, \nI've anchored in Jesus for he hath pow'r to save, \nI've anchored in the Rock of Ages.\n",
    "hymn_title5":"JESUS KEEP ME NEAR THE CROSS",
    "hymn_body5":"1. Jesus, keep me near the cross, \nThere a precious fountain, \nFree to all—a healing stream, \nFlows from Calv’ry’s mountain. \n\nIn the cross, in the cross \nBe my glory ever, \nTill my ransomed soul shall find \nRest beyond the river. \n\n2. Near the cross, a trembling soul, \nLove and mercy found me; \nThere the Bright and Morning Star \nSheds its beams around me. \n\nIn the cross, in the cross \nBe my glory ever, \nTill my ransomed soul shall find \nRest beyond the river. \n\n3. Near the cross! O Lamb of God, \nBring its scenes before me; \nHelp me walk from day to day, \nWith its shadow o’er me. \n\nIn the cross, in the cross \nBe my glory ever, \nTill my ransomed soul shall find \nRest beyond the river. \n\n4. Near the cross! I'll watch and wait, \nHoping, trusting ever; \nTill I reach the golden strand, \nJust beyond the river \n\nIn the cross, in the cross \nBe my glory ever, \nTill my ransomed soul shall find \nRest beyond the river.\n",
    "hymn_tag":"Great is Thy faithfulness!\nGreat is Thy faithfulness!\nMorning by morning new mercies I see;\nall I have needed Thy hand hath provided:\ngreat is Thy faithfulness, Lord, unto me!][It is well with my soul; \nit is well, it is well with my soul.][Heaven came down and glory filled my soul \nWhen at the cross the Savior made me whole \nMy sins were washed away \nAnd my night was turned to day \nHeaven came down and glory filled my soul][I've anchored in Jesus, The storms of life I'll brave, \nI've anchored in Jesus, I fear no wind or wave, \nI've anchored in Jesus for he hath pow'r to save, \nI've anchored in the Rock of Ages.][In the cross, in the cross \nBe my glory ever, \nTill my ransomed soul shall find \nRest beyond the river.",
    "home_tag":"][“Though he slay me, yet will I trust in him: but I will maintain mine own ways before him” (KJV).][Hab.2:3 “This vision is for a future time. It describes the end, and it will be fulfilled. If it seems slow in coming, wait patiently, for it will surely take place. It will not be delayed” (NLT).][“so is my word that goes out from my mouth: It will not return to me empty, but will accomplish what I desire and achieve the purpose for which I sent it” (NLT).][“The Lord is not slow in keeping His promise, as some understand slowness. He is patient with you, not wanting anyone to perish, but everyone to come to repentance (NIV).][Hosanna Parish][Job 13:15][2 Pet. 3:9][Isaiah 55:11][PASTOR TEMPLE ONYEKWENA][PICZ- HOSANNA PARISH][",
    "family_tag":"][1. A oneness marriage needs to grow in wisdom.][2. A oneness marriage needs understanding.][3. A oneness marriage needs knowledge.][You can have a oneness marriage]["
  },
  {
    "month":"5",
    "year":2024,
    "theme":"SUFFICIENT GRACE",
    "text":"2 Corinthians 12:7-10",
    "note":"“(7) And lest I should be exalted above measure through the abundance of the revelations, there was given to me a thorn in the flesh, the messenger of Satan to buffet me, lest I should be exalted above measure. (8) For this thing I besought the Lord thrice, that it might depart from me. (9) And he said unto me, My grace is sufficient for thee: for my strength is made perfect in weakness. Most gladly therefore will I rather glory in my infirmities, that the power of Christ may rest upon me. (10) Therefore I take pleasure in infirmities, in reproaches, in necessities, in persecutions, in distresses for Christ's sake: for when I am weak, then am I strong.” [KJV]",
    "home":"SUFFICIENT GRACE IS A GIFT FROM GOD\nFor by grace you have been saved through faith, and that not of yourself; it is the gift of God, not of works, lest anyone should boast. (Ephesians 2:8-9)\nGod gives us the measure of grace we need to meet the demands of what is happening in our lives at the moment. He does not give us grace for what might happen tomorrow, that would be tomorrow’s grace. He gives us grace to meet the demands of our lives from moment to moment so that we would learn dependence upon Him.\n\nNotice what Apostle Paul is saying:\n(9) And he said to me, “My grace is sufficient for you, for my strength is made perfect in weakness.” (10) Therefore I take pleasure in infirmities, in reproaches, in needs, in persecutions, in distresses, for Christ’s sake. For when I am weak, then I am strong.\nGod’s grace is only experienced when we reach the end of our ability and move into total dependence upon Him.\n\nSUFFICIENT GRACE IS A PRODUCT OF GOD’S PLAN FOR OUR REDEMPTION\n“(7) And lest I should be exalted above measure by the abundance of the revelations, a thorn in the flesh was given to me, a messenger of Satan to buffet me, lest I be exalted above measure. (8) Concerning this thing I pleaded with the Lord three times that it might depart from me. (9) And He said unto me, “My grace is sufficient for you”.\nApostle Paul was a saved man. He knew the joy of the forgiveness of sins. He knew what it was like to be used of God and to have his prayers answered by God. Yet, in this one prayer, God’s answer to Apostle Paul was in effect, Paul, you are going to have to suffer and yet stay faithful to me. You are going to have to persevere in the midst of everything that is wrong with your life. But Paul, My grace is sufficient and I will see you through all of this.\nBeing a Christian will not always guarantee that your life will be forever blissful and problem free.\nIsaiah 43:1a,c-3 But now, thus says the Lord, who created you, Fear not, for I have redeemed you; I have called you by your name; You are Mine. (2) When you pass through the waters, I will be with you; And through the rivers, they shall not overflow you. When you walk through the fire, you shall not be burned, nor shall the flame scorch you. (3) For I am the Lord your God, The Holy One of Israel, your Savior. Isaiah 59:19b when the enemy comes in like a flood, The Spirit of the LORD will lift up a standard against him.\nGod’s promise, in the midst of everything that is going wrong in your life. My grace is sufficient to see you through this thing.\n\nSUFFICIENT GRACE IS ALWAYS ACCESSIBLE\n(9) And He said to me, “My grace is sufficient for you, for my strength is made perfect in weakness.” Therefore most gladly I will rather boast in my infirmities, that the power of Christ may rest upon me.\nGod’s refusal to take away Paul’s trouble was the motivation for Paul to seek God more earnestly, to depend upon Him more fully, and to trust him more completely.\nWhen events occur in your life, God’s motivation is just the same for you as it was for Apostle Paul. God wants to draw you nearer to Himself. He wants to make Himself more real to you and to anoint your life in a way that can happen only when you are completely dependent upon Him.\nPsalm 91:14-16 “Because he has set his love upon Me, therefore I will deliver him; I will set him on high, because he has known My name. (15) He shall call upon Me, and I will answer him; I will be with him in trouble; I will deliver him and honor him. (16) With long life I will satisfy him, And show him My salvation.”\nJeremiah 29:12-14 Then you will call upon Me and go and pray to Me, and I will listen to you. (13) And you will seek Me and find Me, when you search for Me with all your heart. (14) I will be found by you, says the Lord.\nMalachi 3:6a For I am the LORD, I do not change;\nHebrews 13:8 Jesus Christ is the same yesterday, and today, and forever.\nSince God is consistent and constant, so also is His grace.\nIsaiah 58:11 The LORD will guide you continually, And satisfy your soul in drought, And strengthen your bones; You shall be like a watered garden, And like a spring of water, whose waters do no fail.\nHebrews 1:10-12 And: “You, LORD, in the beginning laid the foundation of the earth, And the heavens are the works of Your hands. (11) They will perish, but You remain; And they will all grow old like a garment; (12) Like a cloak You will fold them up, And they will be changed. But You are the same, And Your years will not fail.”\n\nSUFFICIENT GRACE IS EVERLASTING\nYou can hear the optimism in Apostle Paul’s words. He is proudly proclaiming his faith that God will always be there and that God will be all that he will ever need. Apostle Paul’s faith in God’s grace is echoed over and over again in his writings:\n“A Grace is Sufficient” is a sermon that explains how God’s grace is sufficient in all situations. The Lord Jesus promised us that His grace would be sufficient to sustain us, no matter what difficulties we encounter. God’s grace is a gracious gift given out of love. It is a reminder that no matter what we do or how many times we fall down, stumble, or get off-track, God has a relentless, undying, unfathomable, unquenchable love from which we can never be separated from.\n\nIn this month, may THE GRACE OF GOD be sufficient for you, and help you to overcome every closed doors, and may He remove stress that you are passing through. Amen\n\nPASTOR TEMPLE ONYEKWENA\nPICZ- HOSANNA PARISH\n",
    "family_title":"DELAY GRATIFICATION: a tool to rebuild trust in marriage",
    "family_text":"ECCLESIASTES 7:8 - “Better is the end of a thing than its beginning, and the patient in spirit is better than the proud in spirit“\n\nOne of the most significant differences between adolescents and adults is their impulse control. Adolescence is not about a person’s age, but about their emotional maturity. So many of us are walking around in adult bodies controlled by an adolescent inside that has yet to fully grow up. This is quite understandable given how much hardship many endured in childhood and early\n\nThe ability to wait on fulfilling a desire until it is the right, honoring, and correct time is one of the greatest gifts you can give. You will be able to resist the “flesh” that Paul talks about in Romans 7:5 as “our sinful passions.” Impulse control requires that we have a really strong patience muscle. And just like our physical muscles, its growth takes practice and exercise.\n\nEvery instance of broken trust in a relationship stems from the inability to delay gratification. The man who has the sexual affair with his neighbour gave into gratifying his sexual fantasy. The woman who copes with stress by drinking too much wine at night gives into gratifying her desire to numb out to the pain.\n\nThere are countless examples in the Old Testament of men and women who chose not to delay gratification. I’m reminded of King David’s affair with Bathsheba and then his murder of her husband Uriah (1 Samuel 11). Or how about Esau selling his birthright to his brother Jacob because he was hungry (Genesis 25:19-34)? I also think of the story of Cain and Abel. Cain was unable to cope with the stress of feeling like he was displeasing to God. So he lashed out and killed his brother (Genesis 4:3-8).\n\nThese stories and many others shine a light on the devastating impact of giving into a spontaneous impulse. Trust cannot survive when there is uncertainty about impulse control. To rebuild trust means that you'll need to set aside your wants for some amount of time. This can be stressful ... which means that setting aside what you want will probably increase the impulse to act out and cope with the stress!\n\nThere are two ways that you can work on your impulse control and delay gratification. The first is to breathe. When you are tempted, immediately take deep breaths. And when you breath in, invite the peace of God to inhabit your body. When you exhale, think of breathing out the stress and painful issue that you are facing.\n\nSecond, get outside (if possible) and go for a brief walk. Walking with the rest of nature is a restorative practice that can remind you that whatever you are facing doesn’t have to dictate your actions.\n\nThis doesn’t mean that your wants need to go away; they just don’t need to be acted upon immediately. While recovering from their financial situation, Susanna and Rashad agreed to wait 24 hours before making any purchase over $50. Additionally, both had to know about the purchase. But for any purchase of $100, both parties needed to agree. While this felt very businesslike to them, it was a necessary boundary given Susanna’s past indiscretions. Over time, this agreement became more flexible as their trust grew.\n\nOnce you’ve learned how to ride a bike, you no longer need training wheels. Think of the trust-building process like riding a bike. You start off with really safe guidelines. When you make progress, you remove some of those safety measures and have more fun!\n\nLearn to wait. Grow in your ability to be patient. Just because you can get something doesn’t mean that it’s best to do so right away. Developing the ability to wait will be an incredible gift when the time comes when you have no choice but to wait.\nDelaying gratification Builds in you: Patience.\nOthers trust in your: Stability\n",
    "family_site":"https://www.theraineys.org",
    "hymn_total": 4,
    "hymn_title1":"HOLY, HOLY, HOLY",
    "hymn_body1":"1.\tHoly, holy, holy! Lord God Almighty!\nEarly in the morning our song shall rise to Thee;\nHoly, holy, holy! merciful and mighty!\nGod in three Persons, blessed Trinity!\n\n2.\tHoly, holy, holy! all the saints adore Thee,\ncasting down their golden crowns around the glassy sea;\ncherubim and seraphim, falling down before Thee,\nwhich wert and art and evermore shalt be.\n\n3.\tHoly, holy, holy! though the darkness hide Thee,\nthough the eye of sinful man Thy glory may not see;\nonly Thou art holy, there is none beside Thee,\nperfect in pow'r, in love, and purity.\n\n4.\tHoly, holy, holy! Lord God Almighty!\nAll Thy works shall praise Thy name, in earth and sky and sea;\nHoly, holy, holy! merciful and mighty!\nGod in three Persons, blessed Trinity!\n",
    "hymn_title2":"O WORSHIP THE KING, ALL-GLORIOUS ABOVE",
    "hymn_body2":"1.\tO worship the King all-glorious above,\nO gratefully sing his power and his love:\nour shield and defender, the Ancient of Days,\npavilioned in splendor and girded with praise.\n\n2.\tO tell of his might and sing of his grace,\nwhose robe is the light, whose canopy space.\nHis chariots of wrath the deep thunderclouds form,\nand dark is his path on the wings of the storm.\n\n3.\tYour bountiful care, what tongue can recite?\nIt breathes in the air, it shines in the light;\nit streams from the hills, it descends to the plain,\nand sweetly distills in the dew and the rain.\n\n4.\tFrail children of dust, and feeble as frail,\nin you do we trust, nor find you to fail.\nYour mercies, how tender, how firm to the end,\nour Maker, Defender, Redeemer, and Friend!\n\n5.\tO measureless Might, unchangeable Love,\nwhom angels delight to worship above!\nYour ransomed creation, with glory ablaze,\nin true adoration shall sing to your praise!\n",
    "hymn_title3":"MY FAITH HAS FOUND A RESTING PLACE",
    "hymn_body3":"1.\tMy faith has found a resting place,\nfrom guilt my soul is freed;\nI trust the ever-living One,\nhis wounds for me shall plead.\n\nI need no other argument,\nI need no other plea,\nit is enough that Jesus died,\nand that he died for me.\n\n2.\tEnough for me that Jesus saves,\nthis ends my fear and doubt;\na sinful soul, I come to him,\nhe’ll never cast me out.\n\nI need no other argument,\nI need no other plea,\nit is enough that Jesus died,\nand that he died for me.\n\n3.\tMy heart is leaning on the Word,\nthe written Word of God,\nsalvation by my Savior’s name,\nsalvation thro' his blood.\n\nI need no other argument,\nI need no other plea,\nit is enough that Jesus died,\nand that he died for me.\n\n4.\tMy great Physician heals the sick,\nthe lost he came to save;\nfor me his precious blood he shed,\nfor me his life he gave.\n\nI need no other argument,\nI need no other plea,\nit is enough that Jesus died,\nand that he died for me.\n",
    "hymn_title4":"NOTHING BUT THE BLOOD OF JESUS",
    "hymn_body4":"1.\tWhat can wash away my sin?\nNothing but the blood of Jesus.\nWhat can make me whole again?\nNothing but the blood of Jesus.\n\nO precious is the flow\nthat makes me white as snow;\nno other fount I know;\nnothing but the blood of Jesus.\n\n2.\tFor my pardon this I see:\nnothing but the blood of Jesus.\nFor my cleansing this my plea:\nnothing but the blood of Jesus.\n\nO precious is the flow\nthat makes me white as snow;\nno other fount I know;\nnothing but the blood of Jesus.\n\n3.\tNothing can for sin atone:\nnothing but the blood of Jesus.\nNaught of good that I have done:\nnothing but the blood of Jesus.\n\nO precious is the flow\nthat makes me white as snow;\nno other fount I know;\nnothing but the blood of Jesus.\n\n4.\tThis is all my hope and peace:\nnothing but the blood of Jesus.\nThis is all my righteousness:\nnothing but the blood of Jesus.\n\nO precious is the flow\nthat makes me white as snow;\nno other fount I know;\nnothing but the blood of Jesus.\n",
    "hymn_tag":"I need no other argument,\nI need no other plea,\nit is enough that Jesus died,\nand that he died for me.][O precious is the flow\nthat makes me white as snow;\nno other fount I know;\nnothing but the blood of Jesus.",
    "home_tag":"SUFFICIENT GRACE IS A GIFT FROM GOD][Notice what Apostle Paul is saying:][SUFFICIENT GRACE IS A PRODUCT OF GOD’S PLAN FOR OUR REDEMPTION][SUFFICIENT GRACE IS ALWAYS ACCESSIBLE][SUFFICIENT GRACE IS EVERLASTING][PASTOR TEMPLE ONYEKWENA][PICZ- HOSANNA PARISH][THE GRACE OF GOD",
    "family_tag":"Delaying gratification Builds in you: Patience.][Others trust in your: Stability"
  },
  {
    "month":"4",
    "year":2024,
    "theme":"MARCHING FORWARD TO VICTORY (PART 2)",
    "text":"Revelation 3:7",
    "note":"“To the angel of the church in Philadelphia write: These are the words of him who is holy and true, who holds the key of David. What he opens no one can shut, and what he shuts no one can open.” [KJV]",
    "home":"APRIL takes its name from the Latin word aperire, meaning ‘to open’ (just like flowers do in spring) and who wouldn’t want an open door to be set before them?\n\nAn open door (hypothetically speaking) can be likened to new opportunities, but maybe this year so far, you have been up against closed doors, like a no at the interview, rejection, disappointment, lack of growth, etc.\nYou need a door to get into a place and come out of a place. Doors help us to get in and out of a room, car, bus, train, or airplane. This means that where there is no door, a person could be confined or locked up in a particular place. Being confined or tied down to a particular place speaks of stagnation.\nWe all desire growth and progress in every area of our lives. Without open doors, a person can be confined to a particular level or spot. Open doors enhance movement. We need open doors to move from one place to another, from one level to another. Open doors give us access to some blessings, places, people and opportunities.\nRevelation 3:7 describes Jesus as the One that opens a door which no one can shut and the One that shuts a door which no one can open. For the Bible to describe Jesus in this way, it means in this life, everyone needs Christ to open certain doors and to close certain doors. Through this message, the Lord shall close every door in your life that needs to be closed and He shall open all doors you need to progress and be fulfilled in life.\n\nKeys To Open Doors\nMost doors have a key you use to open it and lock it. So also in the spiritual realm, there are keys that are used to open certain doors. In Matthew 16:19, God says that He has given us the keys to the kingdom of heaven. Note that he didn’t say key (singular) but keys (plural), meaning that more than one key is needed to experience open doors. One key may open one door say the door of promotion, but that key may not be able to open the door of healing for you. You may need to use another key. But all the keys you need have been given to you.\nWhat are the keys we need to open doors of favour, victory, deliverance, breakthrough, success, promotion, increase, good health and peace?\n\n1. Praise\nPraise opened the prison doors for Paul and Silas in Acts 16:22-27. Paul and Silas found themselves in prison. They found themselves in a place they needed to get out of. They needed an open door to get out of the prison. What did they do? They started praising God. What happened? The prison doors opened. These men were lost in praise to God. They were not distracted by the things and people around them. All their attention was focused on God. Their praise may not have come from the best of voices, but it was genuine and it was very powerful.\nAs you praise God with everything in you, open doors shall be your portion. Every spiritual, financial, career, and marital prison door will open before you as you give God sincere and quality praise.\nYou have this powerful key in your hand, use it everyday, use it very well. God delights in the praises of His people. Delight Him with your praise and He will arise to open doors for you.\n\n2. Prayer\nIn Acts 12:1-7, we have an account of another instance where prison doors were opened. Peter found himself in a place he didn’t want to be. He found himself in prison. He needed an open door to get out of the prison. Peter received this open door because people were praying earnestly for him.\nMatthew 7:7 says, “ask and it will be given you, seek and you will find, knock and the door will be opened to you”. When we come across closed doors, we are to KNOCK! We are to knock with our prayers and the door will be opened for us. Don’t give up because you are faced with a closed door. Don’t allow closed doors frighten you. Those seemingly closed doors can be opened as you knock with persistent prayers. This is why you must be a person of prayer. The Lord will give you grace to be prayerful.  As you pray, all the doors that have been closed before you will be opened in Jesus name, amen.\n\n3. Discernment\nIn Revelation 3:8, God had opened a door for the church in Philadelphia. When Jesus said that a door had been opened to this church, He wasn’t talking about a door in a physical building. The door He opened to them was not a physical door that could be seen with human eyes, but a spiritual door.\nMany times, there are doors that God has opened for us. The doors may be right before us, but we can’t see them because we lack discernment. It takes discernment to know when a door has been opened for you. In 1 Corinthians 16:9, Paul said a great and effectual door had been opened to him. Certainly, this wasn’t a physical door. Paul discerned the great thing God was about to do in His life. Through spiritual insight, he understood that God had gone ahead of him to open certain doors for him to get to certain people and impact their lives. He saw this open door because He was in touch with God; his spiritual eyes and ears were working perfectly well. If Paul didn’t discern and perceive this open door, he may never have gotten to those God wanted Him to reach for Christ.\nDo you know that it is possible for you to be praying and fasting for an open door in a particular business meanwhile, God has already opened this door? Without discernment, you won’t know which doors the Lord has opened for you. It is good to praise God, it is equally good to pray to God, but if you lack discernment, even when God opens a door for you in response to your praise and prayers, you may not know this. You may miss the divine opportunity that is right before your eyes.\n\n4. Courage\nIt takes courage to walk through open doors. Without courage, you could be staring an open door right in the face, yet not walk through it because you are afraid of what’s behind the door, afraid of what will happen if you walk through that door; if you seize that opportunity.\nIn Psalm 24:7-8, we are told of ancient gates. These gates can be likened to doors; doors that have been closed for a long while that need to be opened. It took courage for the Psalmist to start addressing these ancient gates and telling them to open for the King of Glory to come in. The Psalmist didn’t allow the size of these ancient gates to intimidate him. He didn’t allow how long they had remained closed to frighten him. All he was concerned about, was getting those ancient gates opened. He knew that for the gates to open, he had to boldly and courageously confront these gates to open for the King of Glory.\nMay you receive courage to confront all doors standing before you that need to be opened. And may you be courageous enough to pass through every door God opens to you irrespective of how challenging the door looks or what is on the other side of the door, knowing that if indeed it is God who has opened the door, all will be well as you walk through that door.\n\n5. Giving\nThis is a very powerful key. Giving can open doors you can’t imagine. See the great door of salvation that has been opened to millions of people because God gave His One and only Son to die on the cross. In Malachi 3:6-10, we are told of how giving of one’s tithes can open the floodgates of heaven. These gates can be likened to doors of blessings that we need opened to us. It pays to be generous. Take your giving to another level and watch what God will do in your life. As you generously give of your time, resources, talents and gifts to God’s work and God’s people, may a door that will lift you to higher ground be opened to you.\nIn conclusion, you will observe that doors come in different sizes and designs. They can be made of wood, glass, or iron. Some are very thick, while some are light. Some doors are common and plain, while some can’t help but be noticed because they are unique and stand out. From today, as you stand on the Word of God and declare it over your life, all closed doors no matter their size, no matter their texture, no matter the force of darkness working to see that the doors remain shut, they will burst open for you. As you become a person of praise, prayers, discernment, and courage, as you give lovingly and sacrificially, God will open doors of favour, blessings and opportunities for you.\nI declare into your life that starting from today, the door that will make you stand out, God will open for you. In Jesus name, AMEN!\n\nN.B. Being Born again is the first step to ensure open doors, If you will like to receive Jesus in your heart, Pls Pray: “Dear Lord Jesus, have mercy upon me a sinner, I am sorry for all my sins. I believe you died to save me. Pls be my Lord and savior henceforth in Jesus Name I pray”. Congratulations you are now a child of God. Please reach out to us for follow up and endeavor to join the new believers’ class for teachings to help you grow. The class holds at the gallery on Sundays by 8am\n\nPASTOR TEMPLE ONYEKWENA\nPICZ- HOSANNA PARISH\n",
    "family_title":"LESSONS FROM FORTY YEARS OF MARRIAGE (PART 3)",
    "family_text":"1. COMMUNICATION is the life-giver of a relationship.\nSimply put, find a way to get five, ten, fifteen minutes together to talk every day.Turn the TV off, set the computer aside, take a walk, and just talk with each other.\n\n2. Maximize your wife’s talents, gifts, experience, and passion as you would an Olympic athlete.\nEphesians 5 talks to men about loving their wives as they love their own bodies. Help your wife accomplish everything that God has in mind for her.\nDo an inventory of her gifts, her talents, her passions. What motivates her? What demotivates her? Pray for her and her vision. What are her core competencies? Dream some dreams together, and don’t wait until you’re in the empty nest to dream the dreams. Start dreaming even when you’re building your family.\n\n3. Wives, your respect will fuel your husband, and your contempt will empty his tank.\nEphesians 5:33 commands wives to respect their husbands. Ladies, keep in mind that 93 percent of all communication is non-verbal. How are you expressing belief in your man non-verbally?\n\n4. Your marriage must be built to outlast the kids.\nOur romance gave us children, and our children tried to steal our romance.\nMake effort to have special dinners together and go on short getaways as often as you can. Time alone together Is worth it.\n\n5. Build too many guardrails around your relationship rather than too few.\nMen, don’t trust yourself alone with the opposite sex. I have asked people to go out of their way to take me to speaking engagements instead of one woman taking me. I’ve got a friend who won’t get in an elevator alone with a woman. You may say that’s a little extreme. Let me tell you something, given the fallout today in ministry, no measure is extreme.\n\n6. The first essence of rearing children is “identity.”\nThis has to do with disciplining your child to know his or her spiritual destiny and spiritual address. It also has to do with his or her sexual identity as well.This culture is seeking to distort the image of God embedded in boys and girls; we have to help our children know how to navigate those waters.\n\n7. The second essence of rearing children is “relationship.”\nDisciple your child to know what real love is, how to love another imperfect person, and how to experience love as a human. The Great Commandment makes it clear (Matthew 22:34-40). Life is about relationships. It’s about a relationship with God, loving Him, and it’s also about loving others on the horizontal.\n\n8. The third essence of rearing children is “character.”\nThe book of Proverbs talks about this, obviously. It is disciplining your child to be wise and not be a fool.\n\n9. The fourth essence of rearing children is “mission.”\nIt is no mistake that the Scriptures compares children to arrows in the hands of a warrior. Arrows are meant to be pulled back by an archer, aimed at a target, and let go.\nWhat are you aiming them toward? What are you challenging your children to give their lives to? The Kingdom’s work is paramount. We’re going to need another generation to carry on should Christ tarry.\n\n10. Determine your core values as a couple.\nIn the early years of Barbara’s and my marriage, we went on a little retreat together. She got alone and wrote down the top ten core values that she wanted to produce in our children. I got alone, separate from her, and wrote out my top ten core values for the kids.\nThen we got together and prioritized them, agreeing on our top five. Those five helped us to not compare our family with other families, but to do just what God had called us to do and it helped us be one as a couple\n",
    "family_site":"40 Lessons from 40 Years of Marriage - FamilyLife",
    "hymn_total": 4,
    "hymn_title1":"TO GOD BE THE GLORY",
    "hymn_body1":"1. To God be the glory, great things He hath done,\nSo loved He the world that He gave us His Son,\nWho yielded His life our redemption to win,\nAnd opened the life-gate that all may go in.\n\nPraise the Lord, praise the Lord,\n Let the earth hear His voice;\nPraise the Lord, praise the Lord,\n Let the people rejoice;\nOh, come to the Father, through Jesus the Son,\n And give Him the glory; great things He hath done.\n\n2.\tOh, perfect redemption, the purchase of blood,\nTo every believer the promise of God;\nThe vilest offender who truly believes,\nThat moment from Jesus a pardon receives.\n\nPraise the Lord, praise the Lord,\n Let the earth hear His voice;\nPraise the Lord, praise the Lord,\n Let the people rejoice;\nOh, come to the Father, through Jesus the Son,\n And give Him the glory; great things He hath done.\n\n3.\tGreat things He hath taught us, great things He hath done,\nAnd great our rejoicing through Jesus the Son;\nBut purer, and higher, and greater will be\nOur wonder, our transport when Jesus we see.\n\nPraise the Lord, praise the Lord,\n Let the earth hear His voice;\nPraise the Lord, praise the Lord,\n Let the people rejoice;\nOh, come to the Father, through Jesus the Son,\n And give Him the glory; great things He hath done.\n",
    "hymn_title2":"YIELD NOT TO TEMPTATION",
    "hymn_body2":"1.\tYield not to temptation,\nFor yielding is sin;\nEach vict’ry will help you,\nSome other to win;\nFight valiantly onward,\nEvil passions subdue;\nLook ever to Jesus,\nHe will carry you through.\n\nAsk the Savior to help you,\nComfort, strengthen and keep you;\nHe is willing to aid you,\nHe will carry you through.\n\n2.\tShun evil companions,\nBad language disdain;\nGod’s name hold in rev’rence,\nNor take it in vain;\nBe thoughtful and earnest,\nKindhearted and true;\nLook ever to Jesus,\nHe will carry you through.\n\nAsk the Savior to help you,\nComfort, strengthen and keep you;\nHe is willing to aid you,\nHe will carry you through.\n\n3.\tTo him that o’ercometh,\nGod giveth a crown;\nThrough faith we will conquer,\nThough often cast down;\nHe who is our Savior,\nOur strength will renew;\nLook ever to Jesus,\nHe will carry you through.\n\nAsk the Savior to help you,\nComfort, strengthen and keep you;\nHe is willing to aid you,\nHe will carry you through.\n",
    "hymn_title3":"HOW GREAT THOU ART",
    "hymn_body3":"1.\tO Lord my God, when I in awesome wonder\nConsider all the works Thy hands have made,\nI see the stars, I hear the rolling thunder,\nThy pow’r thru-out the universe displayed!\n\nThen sings my soul, my Savior God, to Thee;\nHow great Thou art, how great Thou art!\nThen sings my soul, my Savior God, to Thee;\nHow great Thou art, how great Thou art!\n\n2.\tWhen thru the woods and forest glades I wander\nAnd hear the birds sing sweetly in the trees,\nWhen I look down from lofty mountain grandeur\nAnd hear the brook and feel the gentle breeze,\n\nThen sings my soul, my Savior God, to Thee;\nHow great Thou art, how great Thou art!\nThen sings my soul, my Savior God, to Thee;\nHow great Thou art, how great Thou art!\n\n3.\tAnd when I think that God, His Son not sparing,\nSent Him to die, I scarce can take it in –\nThat on the cross, my burden gladly bearing,\nHe bled and died to take away my sin!\n\nThen sings my soul, my Savior God, to Thee;\nHow great Thou art, how great Thou art!\nThen sings my soul, my Savior God, to Thee;\nHow great Thou art, how great Thou art!\n\n4.\tWhen Christ shall come with shout of acclamation\nAnd take me home, what joy shall fill my heart!\nThen I shall bow in humble adoration\nAnd there proclaim, my God, how great Thou art!\n\nThen sings my soul, my Savior God, to Thee;\nHow great Thou art, how great Thou art!\nThen sings my soul, my Savior God, to Thee;\nHow great Thou art, how great Thou art!\n",
    "hymn_title4":"MY FAITH HAS FOUND A RESTING PLACE",
    "hymn_body4":"1.\tMy faith has found a resting place,\nfrom guilt my soul is freed;\nI trust the ever-living One,\nhis wounds for me shall plead.\n\nI need no other argument,\nI need no other plea,\nit is enough that Jesus died,\nand that he died for me.\n\n2.\tEnough for me that Jesus saves,\nthis ends my fear and doubt;\na sinful soul, I come to him,\nhe’ll never cast me out.\n\nI need no other argument,\nI need no other plea,\nit is enough that Jesus died,\nand that he died for me.\n\n3.\tMy heart is leaning on the Word,\nthe written Word of God,\nsalvation by my Savior’s name,\nsalvation thro' his blood.\n\nI need no other argument,\nI need no other plea,\nit is enough that Jesus died,\nand that he died for me.\n\n4.\tMy great Physician heals the sick,\nthe lost he came to save;\nfor me his precious blood he shed,\nfor me his life he gave.\n\nI need no other argument,\nI need no other plea,\nit is enough that Jesus died,\nand that he died for me.\n",
    "hymn_tag":"][I need no other argument,\nI need no other plea,\nit is enough that Jesus died,\nand that he died for me.][Then sings my soul, my Savior God, to Thee;\nHow great Thou art, how great Thou art!\nThen sings my soul, my Savior God, to Thee;\nHow great Thou art, how great Thou art!][Ask the Savior to help you,\nComfort, strengthen and keep you;\nHe is willing to aid you,\nHe will carry you through.][Praise the Lord, praise the Lord,\n Let the earth hear His voice;\nPraise the Lord, praise the Lord,\n Let the people rejoice;\nOh, come to the Father, through Jesus the Son,\n And give Him the glory; great things He hath done.][",
    "home_tag":"][Congratulations you are now a child of God.][April takes its name from the Latin word aperire, meaning ‘to open’ (just like flowers do in spring) and who wouldn’t want an open door to be set before them?][Revelation 3:7][Matthew 16:19][1. Praise][Keys To Open Doors][2. Prayer][Acts 12:1-7][Acts 16:22-27][Matthew 7:7][3. Discernment][Revelation 3:8][4. Courage][Psalm 24:7-8][5. Giving][Malachi 3:6-10][N.B.][PASTOR TEMPLE ONYEKWENA][PICZ- HOSANNA PARISH][",
    "family_tag":"][1. COMMUNICATION is the life-giver of a relationship.][2. Maximize your wife’s talents, gifts, experience, and passion as you would an Olympic athlete.][3. Wives, your respect will fuel your husband, and your contempt will empty his tank.][3. Wives, your respect will fuel your husband, and your contempt will empty his tank.][4. Your marriage must be built to outlast the kids.][5. Build too many guardrails around your relationship rather than too few.][6. The first essence of rearing children is “identity.”][7. The second essence of rearing children is “relationship.”][8. The third essence of rearing children is “character.”][9. The fourth essence of rearing children is “mission.”][10. Determine your core values as a couple.]["
  },
  {
    "month":"3",
    "year":2024,
    "theme":"MARCHING FORWARD TO VICTORY (PART 1)",
    "text":"EXODUS 14:15",
    "note":"“And the Jehovah said unto Moses, Wherefore criest thou unto me? speak unto the children of Israel, that they go forward.” [KJV]",
    "home":"GOD wants us to make progress in our spiritual, family, professional, Christian, academic and other areas of life. He wants us to grow in faith, grace, glory and power. The children of Israel were happy to leave Egypt, but faced the challenge of crossing the Red Sea. Then, \"the LORD said unto Moses, speak unto the children of Israel, that they go forward\" (Exodus 14:15). This is because He is not pleased, when we fail to make progress after redemption.\n\nJust as the Israelites were released from bondage and the rigour of the Egyptians upon their lives, the Lord who saved, sanctified filled believers with is Spirit will grant us victory over the world, sicknesses, sin, self and Satan. As heavenly pilgrims, we should desire progress in our fellowship and relationship with God.\n\nThe Lord desires that we maintain constant victory over every temptation and entanglement in the world, and by prayer and perseverance, maintain the peace, purity and power we have. By so doing, the things that defeated or hindered us in the past will be subdued. The children of Israel could have gone into the Promised Land in a few months, but they spent forty years in the wilderness, because they could not confront their enemies. However, Caleb made up his mind to go forward and upward. Thus, he challenged the people and said, “Let us go up at once, and possess it; for we are well able to overcome it\" (Numbers 13:30).\n\nIt is not the will of God for any believer to remain stagnant in the faith after being born again. Therefore, after repentance and sanctification, we must move on to perfection and \"live by faith,\" not by the principles, practices and tradition of the society.\n\nJust as a child's vision and desire is to grow and be like an adult, a true believer's vision and desire is to grow through prayer and perseverance. Sadly, some Christians remain baby- believers all through their lives. They find it difficult to walk consistently in the way of righteousness. Although such people experience revival and spiritual growth after special programmes like a retreat or revival programme, they soon relapse into their old ways of living.\nBut Paul the apostle exhorts, \"That we henceforth be no more children, tossed to and fro, and carried about with every wind of doctrine, by the sleight of men, and cunning craftiness, whereby they lie in wait to deceive; But speaking the truth in love, may grow up into him in all things, which is the head, even Christ\" (Ephesians 4:14,15). We must hear, speak, spread, embrace, believe, stand on, take the truth as a weapon and march on to victory through it.\n\nTo make progress in our Christian journey, we must speak the truth in love, not in anger, jealousy, bitterness, hatred or pride. Also, we must grow in grace, faith, faithfulness and the consciousness of God. Irrespective of differences in race, profession or status, sanctified saints desire to please only the Lord. Thus, they reject every suggestion from Satan or his agents to do evil. With the presence of the Father, Son and Holy Spirit in us, we have victory over satan, temptation and the flesh. Sanctified believers also love their spouses like Christ loves the Church. They take care of each other and love their children, who in turn honour and respect them.\n\nAs we embark on this journey through the month of March, may we march forward in faith, knowing that God is leading us, guiding us n  and empowering us to fulfill His purposes. Let us embrace the new beginnings, the new opportunities, and the new blessings that God has in store for us. And may we continue to walk in obedience, trusting that He who began a good work in us will carry it on to completion until the day of Christ Jesus (Philippians 1:6).\n\nMarch forward to victory, dear brothers and sisters, with faith as your compass, prayer as your strength, and courage as your guide. For in God, we have the victory!\n\nN.B. Being Born again is the first step to ensure open doors, If you will like to receive Jesus in your heart, Pls Pray: “Dear Lord Jesus, have mercy upon me a sinner, I am sorry for all my sins. I believe you died to save me. Pls be my Lord and savior henceforth in Jesus Name I pray”. Congratulations you are now a child of God. Please reach out to us for follow up and endeavor to join the new believers’ class for teachings to help you grow. The class holds at the gallery on Sundays by 8am\n\nPASTOR TEMPLE ONYEKWENA\nPICZ- HOSANNA PARISH\n",
    "family_title":"LESSONS FROM FORTY YEARS OF MARRIAGE (PART 2)",
    "family_text":"1. WHAT you remember is just as important as what you forget.\nWe tend to suffer from spiritual amnesia. Remembrances of the little things and the big things that God has done is important. Milestones remind us of three things: what God has done; who God is—His provision, care, and deliverance; and the need to trust God and walk by faith. When we forget the deeds of God, we will ultimately forget to trust Him.\n\n2. Marriage was designed by God to be missional.\nMatthew 28:19 says, “Go therefore and make disciples of all nations …”  And Acts 13:36 says, “For David, after he had served the purpose of God in his own generation, fell asleep …” Be about the purposes of God, in your generation, with your spouse. Do not be two individuals who are just successfully going their own way. Be a couple who work at merging their life’s purpose and mission together so that you can increasingly share it as you move toward the finish line.\n\nMy challenge to you is this: As a couple, believe God for too much, rather than too little. Remember what A.W. Tozer said, “God is looking for people through whom He can do the impossible. What a pity we plan to do the things we can only do by ourselves.”\n\n3. Never use the d-word in your marriage.\nNever threaten divorce in your marriage. Never let the d-word cross your lips, ever! Instead, use the c-word—commitment, covenant, covenant-keeping love that says, “I’d marry you all over again.” I can still remember an argument my parents had when I was five years old and divorce was not in vogue. Your kids are highly sensitized to what your relationship is like and how you communicate when you disagree. Let them hear of your commitment to one another.\n\n4. Honor your parents.\nExodus 20:12 is the first commandment with a promise: “Honor your father and your mother, that your days may be long in the land that the Lord your God is giving you.”\nYour marriage gets better as you honour your parents.\n\n5. Different isn’t wrong; it’s just different.\nWe marry one another because we’re different, and we divorce each other because we’re different. When Barbara and I moved into the empty-nest phase, we discovered that we are much more different than we ever imagined. Here’s the key—your spouse’s differences are new capacities that God has brought to your life to complete you. Barbara’s an artist and as we began our empty-nest years I told her, “Wherever you go, you make things beautiful.”You see, I didn’t appreciate beauty. I had no idea how beauty reflected the glory of God. Your spouse is God’s added dimension to your life.\n\n6. Marriage and family are redemptive.\nThe way to have a godly marriage and family is the same path as coming to faith in Christ. It is surrender—giving up your rights to Him first, then to your spouse—serving them.\n\n7. A man’s wife is his number one disciple.\nBill Bright, founder of Campus Crusade for Christ (now called Cru in the United States), said countless times that a man’s wife should be his number one disciple.\nHusbands, help your wife grow as a Christian. It’s the smartest thing you could possibly do. When your wife grows in this area, not only does she triumph at life, but you benefit as well.\n\n8. Make your home a storm shelter.\nIn Matthew 7:24-27, Jesus compares two builders of two homes—both in storms. We should get a clue from that: We’re going to build our marriage, our family, our home in the midst of storm warnings, floods, wind, and rain.\nYour marriage covenant is more than just saying, “I do,” for a lifetime.It is for better and for worse. Make your home a storm shelter—a safe place to go in a storm.\n\n9. Suffering will either drive you apart, or it will be used by God to merge you together.\nScripture teaches that our response to God and His Word is the difference-maker in how we handle suffering. You and your spouse have to decide to suffer together rather than falling apart.\n\n10. Loss is a part of life and increases as we age.\nHow you and your spouse process loss, by faith, will determine whether you grow old and bless others, giving them life, or whether you grow old and curse others, becoming a bitter crotchety old person. Process loss well.\n",
    "family_site":"40 Lessons from 40 Years of Marriage - FamilyLife",
    "hymn_total": 5,
    "hymn_title1":"REJOICE, THE LORD IS KING",
    "hymn_body1":"1.\tRejoice, the Lord is King:\nYour Lord and King adore!\nRejoice, give thanks and sing,\nAnd triumph evermore.\nLift up your heart,\nLift up your voice!\nRejoice, again I say, rejoice!\n\n2.\tJesus, the Savior, reigns,\nThe God of truth and love;\nWhen He has purged our stains,\nHe took his seat above;\nLift up your heart,\nLift up your voice!\nRejoice, again I say, rejoice!\n\n3.\tHis kingdom cannot fail,\nHe rules o'er earth and heav'n;\nThe keys of death and hell\nAre to our Jesus giv'n:\nLift up your heart,\nLift up your voice!\nRejoice, again I say, rejoice!\n\n4.\tRejoice in glorious hope!\nOur Lord and judge shall come\nAnd take His servants up\nTo their eternal home:\nLift up your heart,\nLift up your voice!\nRejoice, again I say, rejoice!\n",
    "hymn_title2":"ALL YOUR ANXIETY",
    "hymn_body2":"1.\tIs there a heart o’erbound by sorrow?\nIs there a life weighed down by care?\nCome to the cross, each burden bearing;\nAll your anxiety—leave it there.\n\nAll your anxiety, all your care,\nBring to the mercy seat, leave it there,\nNever a burden He cannot bear,\nNever a friend like Jesus!\n\n2.\t No other friend so swift to help you,\nNo other friend so quick to hear,\nNo other place to leave your burden,\nNo other one to hear your prayer.\n\nAll your anxiety, all your care,\nBring to the mercy seat, leave it there,\nNever a burden He cannot bear,\nNever a friend like Jesus!\n\n3.\tCome then at once; delay no longer!\nHeed His entreaty kind and sweet,\nYou need not fear a disappointment;\nYou shall find peace at the mercy seat.\n\nAll your anxiety, all your care,\nBring to the mercy seat, leave it there,\nNever a burden He cannot bear,\nNever a friend like Jesus!\n",
    "hymn_title3":"WILL YOUR ANCHOR HOLD IN THE STORMS OF LIFE",
    "hymn_body3":"1.\tWill your anchor hold in the storms of life,\nWhen the clouds unfold their wings of strife?\nWhen the strong tides lift, and the cables strain,\nWill your anchor drift or firm remain?\n\nWe have an anchor that keeps the soul\nSteadfast and sure while the billows roll,\nFastened to the Rock which cannot move,\nGrounded firm and deep in the Savior’s love.\n\n2.\tIt is safely moored, ’twill the storm withstand,\nFor ’tis well secured by the Savior’s hand;\nAnd the cables passed from His heart to mine,\nCan defy the blast, through strength divine.\n\nWe have an anchor that keeps the soul\nSteadfast and sure while the billows roll,\nFastened to the Rock which cannot move,\nGrounded firm and deep in the Savior’s love.\n\n3.\tIt will firmly hold in the straits of fear,\nWhen the breakers have told the reef is near;\nThough the tempest rave and the wild winds blow,\nNot an angry wave shall our bark o’erflow.\n\nWe have an anchor that keeps the soul\nSteadfast and sure while the billows roll,\nFastened to the Rock which cannot move,\nGrounded firm and deep in the Savior’s love.\n\n4.\tIt will surely hold in the floods of death,\nWhen the waters cold chill our latest breath;\nOn the rising tide it can never fail,\nWhile our hopes abide within the veil.\n\nWe have an anchor that keeps the soul\nSteadfast and sure while the billows roll,\nFastened to the Rock which cannot move,\nGrounded firm and deep in the Savior’s love.\n",
    "hymn_title4":"LEAVE IT THERE",
    "hymn_body4":"1.\tIf the world from you withhold of its silver and its gold,\nAnd you have to get along with meager fare,\nJust remember, in His Word, how He feeds the little bird,\nTake your burden to the Lord and leave it there.\n\nLeave it there, leave it there,\nTake your burden to the Lord and leave it there.\nIf you trust and never doubt, He will surely bring you out,\nTake your burden to the Lord and leave it there.\n\n2.\tIf your body suffers pain and your health you can’t regain,\nAnd your soul is almost sinking in despair,\nJesus knows the pain you feel, He can save and He can heal,\nTake your burden to the Lord and leave it there.\n\nLeave it there, leave it there,\nTake your burden to the Lord and leave it there.\nIf you trust and never doubt, He will surely bring you out,\nTake your burden to the Lord and leave it there.\n\n3.\tWhen your enemies assail and your heart begins to fail,\nDon’t forget that God in heaven answers prayer;\nHe will make a way for you and will lead you safely through,\nTake your burden to the Lord and leave it there.\n\nLeave it there, leave it there,\nTake your burden to the Lord and leave it there.\nIf you trust and never doubt, He will surely bring you out,\nTake your burden to the Lord and leave it there.\n\n4.\tWhen your youthful days are gone and old age is stealing on,\nAnd your body bends beneath the weight of care,\nHe will never leave you then, He’ll go with you to the end,\nTake your burden to the Lord and leave it there.\n\nLeave it there, leave it there,\nTake your burden to the Lord and leave it there.\nIf you trust and never doubt, He will surely bring you out,\nTake your burden to the Lord and leave it there.\n",
    "hymn_title5":"BLESSED ASSURANCE",
    "hymn_body5":"1.\tBlessed assurance, Jesus is mine!\nOh, what a foretaste of glory divine!\nHeir of salvation, purchase of God,\nborn of his Spirit, washed in his blood.\n\nThis is my story, this is my song,\npraising my Savior all the day long.\nThis is my story, this is my song,\npraising my Savior all the day long.\n\n2.\tPerfect communion, perfect delight,\nvisions of rapture now burst on my sight.\nAngels descending bring from above\nechoes of mercy, whispers of love.\n\nThis is my story, this is my song,\npraising my Savior all the day long.\nThis is my story, this is my song,\npraising my Savior all the day long.\n\n3.\tPerfect submission, all is at rest.\nI in my Savior am happy and bless’d,\nwatching and waiting, looking above,\nfilled with his goodness, lost in his love.\n\nThis is my story, this is my song,\npraising my Savior all the day long.\nThis is my story, this is my song,\npraising my Savior all the day long.\n",
    "hymn_tag":"][This is my story, this is my song,\npraising my Savior all the day long.\nThis is my story, this is my song,\npraising my Savior all the day long.][Leave it there, leave it there,\nTake your burden to the Lord and leave it there.\nIf you trust and never doubt, He will surely bring you out,\nTake your burden to the Lord and leave it there.][We have an anchor that keeps the soul\nSteadfast and sure while the billows roll,\nFastened to the Rock which cannot move,\nGrounded firm and deep in the Savior’s love.][All your anxiety, all your care,\nBring to the mercy seat, leave it there,\nNever a burden He cannot bear,\nNever a friend like Jesus!][",
    "home_tag":"][Congratulations you are now a child of God.][",
    "family_tag":"][1. What you remember is just as important as what you forget.][2. Marriage was designed by God to be missional.][3. Never use the d-word in your marriage.][4. Honor your parents.][5. Different isn’t wrong; it’s just different.][6. Marriage and family are redemptive.][7. A man’s wife is his number one disciple.][8. Make your home a storm shelter.][9. Suffering will either drive you apart, or it will be used by God to merge you together.][10. Loss is a part of life and increases as we age.]["
  },
  {
    "month":"2",
    "year":2024,
    "theme":"DIVINE FULFILMENT",
    "text":"1 Kings 3:1-14",
    "note":"“(1) And Solomon made affinity with Pharaoh king of Egypt, and took Pharaoh's daughter, and brought her into the city of David, until he had made an end of building his own house, and the house of the LORD, and the wall of Jerusalem round about. (2) Only the people sacrificed in high places, because there was no house built unto the name of the LORD, until those days. (3) And Solomon loved the LORD, walking in the statutes of David his father: only he sacrificed and burnt incense in high places. (4) And the king went to Gibeon to sacrifice there; for that was the great high place: a thousand burnt offerings did Solomon offer upon that altar. (5) In Gibeon the LORD appeared to Solomon in a dream by night: and God said, Ask what I shall give thee. (6) And Solomon said, Thou hast shewed unto thy servant David my father great mercy, according as he walked before thee in truth, and in righteousness, and in uprightness of heart with thee; and thou hast kept for him this great kindness, that thou hast given him a son to sit on his throne, as it is this day. (7) And now, O LORD my God, thou hast made thy servant king instead of David my father: and I am but a little child: I know not how to go out or come in. (8) And thy servant is in the midst of thy people which thou hast chosen, a great people, that cannot be numbered nor counted for multitude. (9) Give therefore thy servant an understanding heart to judge thy people, that I may discern between good and bad: for who is able to judge this thy so great a people? (10) And the speech pleased the Lord, that Solomon had asked this thing. (11) And God said unto him, Because thou hast asked this thing, and hast not asked for thyself long life; neither hast asked riches for thyself, nor hast asked the life of thine enemies; but hast asked for thyself understanding to discern judgment; (12) behold, I have done according to thy words: lo, I have given thee a wise and an understanding heart; so that there was none like thee before thee, neither after thee shall any arise like unto thee. (13) And I have also given thee that which thou hast not asked, both riches, and honour: so that there shall not be any among the kings like unto thee all thy days. (14) And if thou wilt walk in my ways, to keep my statutes and my commandments, as thy father David did walk, then I will lengthen thy days.” [KJV]",
    "home":"I SHALL FULFILL MY DIVINE PURPOSE!\n”For I know the thoughts that I think toward you, saith the Lord, thoughts of peace, and not of evil, to give you an expected end.” Jeremiah 29:11.\nWHAT DOES IT MEAN TO FULFILL YOUR DIVINE PURPOSE?\nGod has an agenda for everything which He has created, including human beings. God lives in heaven but His agenda is to be carried out on earth.  God has an idea or a need that He wants to do on earth and with this in mind He creates a person to carry out that assignment for Him. Therefore, every human being has a divine purpose to fulfill earth. God had a divine plan and an expected end for our lives before we were even conceived in our mother’s wombs. Jeremiah 1:5. In the book of Jeremiah, God said to Jeremiah, the prophet, “Before I formed you in your mother’s womb I knew you and I ordained you as a prophet to the nations.” Jeremiah 1:5. God has His divine calendar and has ordained a set time and a season for everything under the sun. Ecclesiastes 3:1-4. The problem is that the enemy also has a plan for your life and seeks to impose his plan over God’s plan. He delights in rewriting destinies from how God ordained them, particularly glorious ones. John 10:10, 1 Peter 5:8. He wants your life to align with his evil agenda and to fulfill his satanic purpose and not God’s. “Fulfil” means to actualize God’s divine plans and agenda for your life here on earth. It is to manifest the fullness of God for your life. Romans 8:19. Proverbs 25:2. Therefore, we should find out our specific assignments that He has sent us here to carry out for Him on earth and then with diligence fulfill it. You will also learn the pitfalls to avoid in doing this.\n\nWHAT CAN PREVENT YOU FROM FULFILLING YOUR DIVINE PURPOSE?\nThere are several factors that can prevent us from fulfilling our God ordained assignments here on earth. \n1. Faulty Foundation: If your foundation is not strong it will be impossible for it to support you to fulfill your divine purpose. Ancestral powers, foundational strongmen, witchcraft power and household wickedness powers will all gang up and ensure that you do not carry out your purpose.\n2. Unbroken curses and covenants.\n3. Unfriendly friends:. Proverbs 23:4. Evil association corrupts good manners 1 Corinthians 15:33. Forming evil association with God’s enemies can truncate colorful destinies. We see this in the lives of King Solomon and Samson in the Bible.\n4. Internal stumbling blocks: These include anger, jealousy, pride, covetousness, and greed. Greed prevented Gehazi, Elisha’s servant, from fulfilling his divine destiny. 2 Kings 5:20-27.\n5. Laziness: It takes hard work to fulfill divine purpose.\n6. Lack of wisdom: Wisdom is the ability to know how to address the issues of life. Wisdom is the principal thing in life. Proverbs 4:7. If we want to fulfill divine purpose we should pray for it and get it. James 1:5.\n7. Rebellion and disobedience: This is what wasted the lives of Samson and King Saul and prevented them from fulfilling their divine purpose. Judges 16:1-36, 1 Samuel 15:23\n8. Unbelief: 2 Chronicles 20:20. This the inability of believing words spoken by God directly, through His written word, and through His prophets. The Israelites under Moses suffered from this and it prevented them from reaching their destination. Matthew 13:58, Luke 1:45.\nSay: “I will reach my goal in the name of Jesus”.\n9. Discouragement and Frustration: These are weapons that the devil employs often to steal from God’s people and to make them to turn back and not reach their God ordained destination.  The best way to fight discouragement is to encourage yourself in the Lord like David did when his enemies took his family captive and his followers threatened to stone him to death. 1 Samuel 30:3-8. There are various ways of doing this. One is to dig into the word of God and meditate on scriptures that pertains to what you are going through to receive hope and encouragement. Another is to do what Paul and Silas did in their midnight hour which was to praise and worship God. Acts 16:25-26. Yet another is to pray and ask God for the way out of the situation. When you do these three things mentioned here, discouragement flees.\n\nPRAYERS\n1.\tBy the grace of God, I declare that every deferred promise of God in my life comes to pass (Proverbs 13: 12)\n2.\tMay the grace of God bring a divine visitation to every pending promise of God for my destiny and family (Genesis 21: 1-3; Nehemiah 9: 8)\n3.\tToday I declare that by the grace of God I will fulfill my days and years in the land of the living (Exodus 23: 26)\n4.\tIn the name of Jesus Christ, I pray that none of the spoken word of promise over my life and destiny will fall to the ground (1 Samuel 3: 19; 1 Kings 8: 56)\n5.\tIn the name of Jesus Christ, I declare that every prolonged word of promise over my life shall graciously come to pass (Joshua 21: 45; Psalm 105: 19)\n6.\tToday I also promise by God’s grace to fulfill all my vows to the God of Hope in appreciation of His gracious goodness in my life and family (Psalm 22: 5; Proverbs 7: 14; Ecclesiastes 5: 5)\n\nNOTE: Being Born again is the first step to ensure open doors, If you will like to receive Jesus in your heart, Pls Pray: “Dear Lord Jesus, have mercy upon me a sinner, I am sorry for all my sins. I believe you died to save me. Pls be my Lord and savior henceforth in Jesus Name I pray”. Congratulations you are now a child of God. Please reach out to us for follow up and endeavor to join the new believers’ class for teachings to help you grow. The class holds at the gallery on Sundays by 8am\n\nPASTOR TEMPLE ONYEKWENA\nPICZ- HOSANNA PARISH\n",
    "family_title":"LESSONS FROM FORTY YEARS OF MARRIAGE (PART 1)",
    "family_text":"1. MARRIAGE and family are about the glory of God.\nGenesis 1:27 makes it clear, “So God created man in his own image, in the image of God he created him; male and female he created them.” From the beginning, marriage has been central to God’s glory on planet Earth. The Bible begins with a marriage and ends with a marriage. What God designed, lifted up, and gave a transcendent purpose, man has dumbed down.\n\nMany today make the purpose of marriage to be one’s personal happiness—of finding another person who meets my needs. God created marriage to reflect His image, to reproduce a godly heritage, and to stand together in spiritual battle. Your marriage, your covenant-keeping love, will be your greatest witness of the gospel of Jesus Christ. Marriage is about the glory of God—not about the happiness of man.\n\n2. Marriage is taking place on a spiritual battlefield, not on a romantic balcony.\nSatan’s first attack on the image of God was to destroy the image-bearers’ relationship with Him. Then Satan went after Adam and Eve and their relationship with one another. If he targeted marriage to begin with, why would we think our marriages would be any different? I think we often forget that our marriage—our family—can be targeted by the enemy to destroy the image-bearers, to destroy the legacy that is passed on to future generations. I believe that the very definition of marriage is under attack today because of who created marriage, God.\n\n3. Your spouse is not your enemy.\nEphesians 6:12 tells us that our battle is not against flesh and blood. Have you ever looked at your spouse in the morning as your enemy, asking God, “What did you do in bringing us together?” I\nBut the Scriptures tell us, your mate is not your enemy. Your mate is a gift from God to you. In all his imperfections—in all her imperfections—God has given you a gift. You can either receive it by faith, or you can reject it.\n\n4. The couple that prays together stays together.\nIn the first months of my marriage, I went to a friend named Carl Wilson and said, “Carl, you’ve been married 25 years. You’ve got five kids. What’s the best single piece of advice you can give me, as a young man who’s just starting out his marriage?” “Oh, that’s easy,” he said. “Pray with your wife every day.” I said: “That’s it? ‘Pray with your wife’?” “That’s it.” So I went home, and Barbara and I started praying together. This worked really well for a couple of months … until the night when we went to bed facing opposite walls. Although it wasn’t the most comfortable position physically, it expressed where we were spiritually and emotionally.\nThere seemed to be a tap on my shoulder that night, and it wasn’t Barbara. God was speaking to me in my conscience. He said: “Hey, Rainey! Aren’t you going to pray with her tonight?” I said, “I don’t like her tonight!” He said, “Yes, but you made the commitment to pray every day with your wife.” And I said, “But God, you know that in this situation, she is 90 percent wrong!”\nGod said, “Yes, but it was your 10 percent that caused her to be 90 percent wrong.”\nI wanted to roll over and say, “Sweetheart, will you forgive me for being 10 percent wrong?” But after the words got caught in my throat, I said, “Will you forgive me for … ?” Barbara and I are both strong-willed, stubborn, rebellious people. But we’ve been transformed by praying together. Now we are two strong-willed people who bow their wills before almighty God, on a daily basis, and invite Him into our presence. Praying with your spouse will change the course of your marriage and legacy.\n\n5. Isolation is a subtle killer of relationships.\nGenesis 2:24 gives us a prescription from Scripture: Leave, cleave, and become one. The enemy of our souls does not want a husband and wife to be one. Instead, he wants to divide us. In John 17, Jesus prayed for the church to be one. He realized that when we are in isolation, we can be convinced of anything. Isolation kills relationships.\n\n6. It’s easier for two broken people to build a marriage and family from the same set of biblical blueprints.\nWhat would a physical house look like if you had two different architects, two different builders, and two different sets of blueprints? You’d get some pretty funny-looking houses, wouldn’t you? The same thing will happen in your marriage if you and your spouse are building your relationship and family from different plans.\n\n7.  It is healthy to confess your sins to your spouse.\nJames 5:16 reminds us, “Confess your sins to one another and pray for one another, that you may be healed.” If you want to be healthy, develop a marriage relationship where your spouse has access to the interior of your soul.  Maybe you’re struggling with a bad attitude, a sense of rebellion, toying with something you shouldn’t be toying with. Bring your spouse into the interior of your soul so that you may be healed.\n\n8. It is impossible to experience marriage as God designed it without being lavish in your forgiveness of one another.\nEphesians 4:32 says we should forgive each other “just as God in Christ forgave you.” Failing to forgive or to ask for forgiveness kills oneness, and unity, and life in a marriage. “A happy marriage is the union of two good forgivers.” Why is this true? Because forgiveness means we give up the right to punish the other person. In a marriage relationship there are plenty of things (either committed or omitted) where you’re going to have to give up the right to punish the other person. Bitterness does not create oneness.\n\n9. One of the greatest threats in any marriage is losing a teachable heart.\nProverbs 4:23 reminds us, “Keep your heart with all vigilance, for from it flow the springs of life.” Most of us do all we can to prevent a heart attack. Why? Because there’s a simple equation: If the heart dies, you die.\nThe Bible is filled with references to the heart. In fact, the Great Commandment is one that calls our heart to love God totally and fully, and to love our neighbor as ourselves. Pay attention to your heart. Guard it lest it become hardened or not teachable. A teachable heart is a spiritually-receptive heart. When was the last time you asked your spouse to forgive you? When did you last listen to a child who had perhaps been hurt by you? Remember, from the heart flows the springs of life.\n\n10. Every couple needs a mentor couple who is one lap ahead of them in the seasons of life.\nWho’s your couple? Who’s your person? If you’re a newlywed, you need someone to coach you on the habits you establish at the beginning of your marriage. If you’re starting out with your kids, you need someone just to say: “You know what? This is normal. This is the way it happens.” Even if you are moving into the empty nest with adult children, I’ve got news for you: You really need a mentor in that phase! \nWho’s your mentor? Be careful about who’s speaking into your life.\n",
    "family_site":"40 Lessons from 40 Years of Marriage - FamilyLife",
    "hymn_total": 4,
    "hymn_title1":"O WORSHIP THE KING, ALL-GLORIOUS ABOVE",
    "hymn_body1":"1.\tO worship the King all-glorious above,\nO gratefully sing his power and his love:\nour shield and defender, the Ancient of Days,\npavilioned in splendor and girded with praise.\n\n2.\tO tell of his might and sing of his grace,\nwhose robe is the light, whose canopy space.\nHis chariots of wrath the deep thunderclouds form,\nand dark is his path on the wings of the storm.\n\n3.\tYour bountiful care, what tongue can recite?\nIt breathes in the air, it shines in the light;\nit streams from the hills, it descends to the plain,\nand sweetly distills in the dew and the rain.\n\n4.\tFrail children of dust, and feeble as frail,\nin you do we trust, nor find you to fail.\nYour mercies, how tender, how firm to the end,\nour Maker, Defender, Redeemer, and Friend!\n\n5.\tO measureless Might, unchangeable Love,\nwhom angels delight to worship above!\nYour ransomed creation, with glory ablaze,\nin true adoration shall sing to your praise!\n",
    "hymn_title2":"HAVE YOU BEEN TO JESUS FOR THE CLEANSING POW’R?",
    "hymn_body2":"1.\tHave you been to Jesus for the cleansing pow’r?\nAre you washed in the blood of the Lamb?\nAre you fully trusting in His grace this hour?\nAre you washed in the blood of the Lamb?\n\nAre you washed in the blood,\nIn the soul-cleansing blood of the Lamb?\nAre your garments spotless? Are they white as snow?\nAre you washed in the blood of the Lamb?\n\n2.\tAre you walking daily by the Savior’s side?\nAre you washed in the blood of the Lamb?\nDo you rest each moment in the Crucified?\nAre you washed in the blood of the Lamb?\n\nAre you washed in the blood,\nIn the soul-cleansing blood of the Lamb?\nAre your garments spotless? Are they white as snow?\nAre you washed in the blood of the Lamb?\n\n3.\tWhen the Bridegroom cometh will your robes be white!\nAre you washed in the blood of the Lamb?\nWill your soul be ready for His presence bright,\nAnd be washed in the blood of the Lamb?\n\nAre you washed in the blood,\nIn the soul-cleansing blood of the Lamb?\nAre your garments spotless? Are they white as snow?\nAre you washed in the blood of the Lamb?\n\n4.\tLay aside the garments that are stained with sin,\nAnd be washed in the blood of the Lamb;\nThere’s a fountain flowing for the soul unclean,\nO be washed in the blood of the Lamb.\n\nAre you washed in the blood,\nIn the soul-cleansing blood of the Lamb?\nAre your garments spotless? Are they white as snow?\nAre you washed in the blood of the Lamb?\n",
    "hymn_title3":"WILL YOUR ANCHOR HOLD IN THE STORMS OF LIFE",
    "hymn_body3":"1.\tWill your anchor hold in the storms of life,\nWhen the clouds unfold their wings of strife?\nWhen the strong tides lift, and the cables strain,\nWill your anchor drift or firm remain?\n\nWe have an anchor that keeps the soul\nSteadfast and sure while the billows roll,\nFastened to the Rock which cannot move,\nGrounded firm and deep in the Savior’s love.\n\n2.\tIt is safely moored, ’twill the storm withstand,\nFor ’tis well secured by the Savior’s hand;\nAnd the cables passed from His heart to mine,\nCan defy the blast, through strength divine.\n\nWe have an anchor that keeps the soul\nSteadfast and sure while the billows roll,\nFastened to the Rock which cannot move,\nGrounded firm and deep in the Savior’s love.\n\n3.\tIt will firmly hold in the straits of fear,\nWhen the breakers have told the reef is near;\nThough the tempest rave and the wild winds blow,\nNot an angry wave shall our bark o’erflow.\n\nWe have an anchor that keeps the soul\nSteadfast and sure while the billows roll,\nFastened to the Rock which cannot move,\nGrounded firm and deep in the Savior’s love.\n\n4.\tIt will surely hold in the floods of death,\nWhen the waters cold chill our latest breath;\nOn the rising tide it can never fail,\nWhile our hopes abide within the veil.\n\nWe have an anchor that keeps the soul\nSteadfast and sure while the billows roll,\nFastened to the Rock which cannot move,\nGrounded firm and deep in the Savior’s love.\n",
    "hymn_title4":"JESUS ONLY IS OUR MESSAGE",
    "hymn_body4":"1. Jesus only is our message,\nJesus all our theme shall be;\nWe will lift up Jesus ever,\nJesus only will we see.\n\nJesus only, Jesus ever,\nJesus all in all we sing,\nSavior, Sanctifier, and Healer,\nGlorious Lord and coming King\n\n2. Jesus only is our Savior,\nAll our guilt He bore away,\nHe, our righteousness forever,\nAll our strength from day to day\n\nJesus only, Jesus ever,\nJesus all in all we sing,\nSavior, Sanctifier, and Healer,\nGlorious Lord and coming King\n\n3. Jesus only is our Healer,\nAll our sicknesses He bare,\nAnd His risen life and fulness,\nAll His members still may share.\n\nJesus only, Jesus ever,\nJesus all in all we sing,\nSavior, Sanctifier, and Healer,\nGlorious Lord and coming King\n\n4. And for Jesus we are waiting,\nList’ning for the Advent Call;\nBut ’twill still be Jesus only,\nJesus ever, all in all.\n\nJesus only, Jesus ever,\nJesus all in all we sing,\nSavior, Sanctifier, and Healer,\nGlorious Lord and coming King\n",
    "hymn_tag":"][We have an anchor that keeps the soul\nSteadfast and sure while the billows roll,\nFastened to the Rock which cannot move,\nGrounded firm and deep in the Savior’s love.][Jesus only, Jesus ever,\nJesus all in all we sing,\nSavior, Sanctifier, and Healer,\nGlorious Lord and coming King][Are you washed in the blood,\nIn the soul-cleansing blood of the Lamb?\nAre your garments spotless? Are they white as snow?\nAre you washed in the blood of the Lamb?][",
    "home_tag":"][Congratulations you are now a child of God.][WHAT DOES IT MEAN TO FULFILL YOUR DIVINE PURPOSE?][WHAT CAN PREVENT YOU FROM FULFILLING YOUR DIVINE PURPOSE?][1. Faulty Foundation:][2. Unbroken curses and covenants.][3. Unfriendly friends:][4. Internal stumbling blocks:][5. Laziness:][6. Lack of wisdom:][7. Rebellion and disobedience:][8. Unbelief:][9. Discouragement and Frustration:][PRAYERS][NOTE:][PASTOR TEMPLE ONYEKWENA][PICZ- HOSANNA PARISH][",
    "family_tag":"][1. Marriage and family are about the glory of God.][2. Marriage is taking place on a spiritual battlefield, not on a romantic balcony.][3. Your spouse is not your enemy.][4. The couple that prays together stays together.][5. Isolation is a subtle killer of relationships.][6. It’s easier for two broken people to build a marriage and family from the same set of biblical blueprints.][7.  It is healthy to confess your sins to your spouse.][8. It is impossible to experience marriage as God designed it without being lavish in your forgiveness of one another.][8. It is impossible to experience marriage as God designed it without being lavish in your forgiveness of one another.][9. One of the greatest threats in any marriage is losing a teachable heart.][10. Every couple needs a mentor couple who is one lap ahead of them in the seasons of life.]["
  },
  {
    "month":"1",
    "year":2024,
    "theme":"FRESH ANOINTING",
    "text":"Psalm 91:1",
    "note":"“He that dwelleth in the secret place of the Most High shall abide under the shadow of the Almighty.” [KJV]",
    "home":"WE are told in Psalm 91 what happens to those who learn to dwell in the “secret place of the Most High.” Not only can we “abide under the shadow of the Almighty,” but He will be our refuge and fortress as He delivers us from the enemy’s snares and pestilences. We won’t have to be afraid of terrors, for “there shall no evil befall thee, neither shall any plague come nigh thy dwelling.”\n\nHow do we get into that secret place of the Most High where we can find a precious anointing of blessing, healing, protection, favor, and so much more? The psalmist points to the necessity of dwelling daily in the presence of the Lord, literally abiding in Him, experiencing wave after wave of His fresh anointing! But how do we prepare…?\n\nWe are moving into a fresh new season of anointing, and in preparation, God has impressed upon my heart again and again that it is time for believers to prepare for the coming wave of outpouring.\n\nHow about you? In today’s uncertain times, do you need His favor and protection against the storms of life?\n\nAre you ready to move into God’s fresh anointing?\n\nAll you need in life can be found in God’s mighty presence!\n\nIf you need a miracle (and desire a fresh anointing for a life of miracles), move into His presence and discover what our Lord has in store for you.\n\nThe necessity of the Holy Spirit’s Daily Anointing\nIt does not matter who you are or what experience you’ve had in the past. Sometimes the greatest hindrance to what God wants to do in your life today is relying on what God did yesterday.\n\nThough God’s Word remains constant and sure, His Spirit is always moving; He is not doing the same thing today that He did yesterday. You must never be so caught up in past experiences with the Lord that you miss what He is saying and doing right now.\n\nJust as in the times of old when the gathering of fresh manna was required daily, a new anointing requires fresh oil every day!\n\nJesus said, “It is written, Man shall not live by bread alone, but by every word that proceeds out of the mouth of God” (Matthew 4:4, NKJV). Notice that the Word of God says “proceeds,” which is present tense.\n\nMany wonderful and well-meaning saints are empty today because they are hanging on to what God spoke to them in the past. How He moved and guided yesterday was perfect and right for then, but God is the God of the present, right now. He is speaking today, and it is up to you to listen to His voice.\n\nIt is of the Lord’s mercies that we are not consumed, because his compassion fails not. They are new every morning: great is thy faithfulness (Lamentations 3:22-23).\n\nThere is simply no other way to live now, have power now, and operate in God’s anointing now than to live by the Word that proceeds out of His mouth now.\n\nKeep in mind, throughout the following paragraphs, I will use the term “daily” about the Holy Spirit’s anointing. More accurately, these guidelines should be something that takes place throughout each day!\n\nTo move into a fresh anointing, we must spend intimate time in His presence every day. To do this, we must begin each day by yielding to the Holy Spirit.\n\nMoving from unrighteousness to yielding to righteousness is a lifelong challenge. Just because you receive Jesus Christ as Savior and the Holy Spirit’s infilling, you are not insulated from spiritual “pruning” and discipline.\n\nIn fact, most mountaintop experiences are followed by wilderness times. It was certainly that way with the Savior: “Jesus being full of the Holy Ghost returned from Jordan, and was led by the Spirit into the wilderness, being forty days tempted of the devil” (Luke 4:1-2 KJV).\n\nI believe the wilderness era teaches authority. When we go through trials, we can only be successful by yielding to the Holy Spirit during both good and difficult times.\n\nYielding continually not only opens us to fresh waves of anointing but also helps us mature in the Lord.\n\nAll of us start out as spiritual babies. We want everything right now. We demand answers to our smallest problems. We whine when we don’t get our way. Yet when we yield to the Holy Spirit, we gain a seasoned ability to be led by the Holy Spirit. We learn God’s timing; it is a step-by-step process of dying to our own desires and surrendering to the Father’s.\n\nIt begins with an ever-growing hunger and thirst for Him. The freshness of the anointing then comes supernaturally!\n\nJesus said, “If any man thirst, let him come unto me, and drink” (John 7:37 KJV). How hungry are you to see the power of God at work in your life? He measures your hunger by your desire to do what He wants, to seek His guidance, to surrender to His will.\n\nAnd only then can we be used effectively to impact our world. When we are told in Scripture to “be filled with the Spirit” (Ephesians 5:18) it is not a mere piece of advice. It is not a suggestion. It is a direct order from heaven! It is God’s command. And it is a prerequisite for a continual freshness of the anointing.\n\nWhy? Our Father knows that we cannot do all we must do without being empowered by His fresh anointing, and we cannot be empowered or anointed without yielding to Him day by day, hour by hour, as we seek a fresh anointing to fulfill the Great Commission during our lifetime.\n\nPrepare for the fresh anointing by yielding to Him continually! Through daily worship\n\nPASTOR TEMPLE ONYEKWENA\nPICZ- HOSANNA PARISH\n",
    "family_title":"Four Foundational Laws of Marriage",
    "family_text":"EVERYTHING GOD creates is made to succeed. But all things operate by laws and principles and the Bible is the instruction manual for how to live by them. (Jos. 1:8 NIV). Also, God’s Word is law like the laws that govern gravity, aerodynamics and electricity; only more sure and reliable. They are immutable, indiscriminate and infallible. b. (Rom. 8:2; Rom. 3:27)\n\n1. The Law of Priority\n(Gen. 2:24a) “Therefore a man shall leave his father and his mother…”\na. Reprioritization of relationships\nb. Legitimate jealousy – (Exo. 34:14 NLT)\nc. How to establish and maintain the right priorities in marriage.\n~Priority has to be proven in real terms and not just words.\n-Sacrifice – what will you give up for me?\n-Time – the commodity of relationships\n-Energy – effort in the relationship\n-Attitude – “I want to be with you.”\n~You constantly have to protect your marriage from good things out of priority.\n-God/spouse/children/church/work\n\n2. The Law of Pursuit\n(Gen. 2:24b) “…and shall cleave unto his wife…”\na. cleave – to adhere firmly and closely or loyally and unwaveringly; to pursue with all energy.\n~Marriage is work! When you’re dating you work to get them, but often take them for granted when we get them.\nb. Marriage is not two perfectly compatible people with no problems. Marriage is two very different people with a lot of incompatibility who work at it.\nc. Emotions most likely will not always be there!\nd. The grass is greener on the other side syndrome!\ne. Marriage operates on the “manna principle.”\n~Regular date times.\nf. You must work at being your best for each other.\n\n3. The Law of Possession\n(Gen. 2:24c) “…and they shall be one flesh.”\na. Marriage is about sharing full ownership of everything in life: time, money, children, and bodies etc.\n~Most challenging in blended families.\nb. No longer independence, but interdependence.\nc. Oneness not dominance!\nd. (1 Cor. 7:2-5 NLT) sex in marriage\n\n4. The Law of Purity\n(Gen. 2:25) “And they were both naked, the man and his wife, and were not ashamed.”\na. Transparency in everything! Nakedness without shame!\nb. Never shaming each other but feeling safe about being transparent about everything.\nc. After Adam/Eve sinned they put on fig leaves over their genitals and blamed each other for their wrong.\n~We must be willing to admit our wrong, repent so we can remain naked.\n",
    "family_site":"https://destinygso.org/note/4-foundational-laws-of-marriage/",
    "hymn_total": 4,
    "hymn_title1":"GREAT IS THY FAITHFULNESS",
    "hymn_body1":"1.\tGreat is Thy faithfulness, O God my Father;\nthere is no shadow of turning with Thee;\nThou changest not, Thy compassions, they fail not;\nas Thou hast been, Thou forever wilt be.\n\nGreat is Thy faithfulness!\nGreat is Thy faithfulness!\nMorning by morning new mercies I see;\nall I have needed Thy hand hath provided:\ngreat is Thy faithfulness, Lord, unto me!\n\n2.\tSummer and winter, and springtime and harvest;\nsun, moon, and stars in their courses above\njoin with all nature in manifold witness\nto Thy great faithfulness, mercy, and love.\n\nGreat is Thy faithfulness!\nGreat is Thy faithfulness!\nMorning by morning new mercies I see;\nall I have needed Thy hand hath provided:\ngreat is Thy faithfulness, Lord, unto me!\n\n3.\tPardon for sin and a peace that endureth,\nThine own dear presence to cheer and to guide;\nstrength for today and bright hope for tomorrow:\nblessings all mine, with ten thousand beside!\n\nGreat is Thy faithfulness!\nGreat is Thy faithfulness!\nMorning by morning new mercies I see;\nall I have needed Thy hand hath provided:\ngreat is Thy faithfulness, Lord, unto me!\n",
    "hymn_title2":"PRAISE HIM! PRAISE HIM! JESUS, OUR BLESSED REDEEMER!",
    "hymn_body2":"1. Praise Him! praise Him! Jesus, our blessed Redeemer!\nSing, ye saints! His wonderful love proclaim!\nHail Him! hail Him! mightiest angels in glory;\nStrength and honor give to His holy name!\nLike a shepherd, Jesus will feed His people,\nIn His arms He carries them all day long;\nO ye saints that live in the light of His presence,\nPraise Him! praise Him! ever in joyful song!\n\n2. Praise him, praise him! Jesus, our blessed redeemer!\nFor our sins, he suffered, and bled, and died.\nHe our rock, our hope of eternal salvation,\nhail him, hail him! Jesus, the crucified.\nLoving Savior, meekly enduring sorrow,\nCrowned with thorns that cruelly pierced His brow;\nOnce for us rejected, despised, and forsaken,\nPrince of Glory, ever triumphant now.\n\n3. Praise Him! praise Him! Jesus, our blessed Redeemer,\nHeavenly portals, loud with hosannahs ring!\nJesus, Savior, reigneth for ever and ever;\nCrown Him! crown Him! Prophet and Priest and King!\nDeath is vanquished! Tell it with joy, ye faithful,\nWhere is now thy victory, boasting grave?\nJesus lives! No longer thy portals are cheerless;\nJesus lives, the mighty and strong to save.\n",
    "hymn_title3":"O GOD, OUR HELP IN AGES PAST",
    "hymn_body3":"1.\tO God, our help in ages past,\nOur hope for years to come,\nOur shelter from the stormy blast,\nAnd our eternal home.\n\n2.\tUnder the shadow of Thy throne\nThy saints have dwelt secure;\nSufficient is Thine arm alone,\nAnd our defence is sure.\n\n3.\tA thousand ages in Thy sight\nAre like an evening gone;\nShort as the watch that ends the night\nBefore the rising sun.\n\n4.\tO God, our help in ages past,\nOur hope for years to come,\nBe Thou our guard while life shall last,\nAnd our eternal home\n",
    "hymn_title4":"REJOICE, THE LORD IS KING",
    "hymn_body4":"1.\tRejoice, the Lord is King:\nYour Lord and King adore!\nRejoice, give thanks and sing,\nAnd triumph evermore.\nLift up your heart,\nLift up your voice!\nRejoice, again I say, rejoice!\n\n2.\tJesus, the Savior, reigns,\nThe God of truth and love;\nWhen He has purged our stains,\nHe took his seat above;\nLift up your heart,\nLift up your voice!\nRejoice, again I say, rejoice!\n\n3.\tHis kingdom cannot fail,\nHe rules o'er earth and heav'n;\nThe keys of death and hell\nAre to our Jesus giv'n:\nLift up your heart,\nLift up your voice!\nRejoice, again I say, rejoice!\n\n4.\tRejoice in glorious hope!\nOur Lord and judge shall come\nAnd take His servants up\nTo their eternal home:\nLift up your heart,\nLift up your voice!\nRejoice, again I say, rejoice!\n",
    "hymn_tag":"][Great is Thy faithfulness!\nGreat is Thy faithfulness!\nMorning by morning new mercies I see;\nall I have needed Thy hand hath provided:\ngreat is Thy faithfulness, Lord, unto me!][",
    "home_tag":"][The necessity of the Holy Spirit’s Daily Anointing][PASTOR TEMPLE ONYEKWENA][PICZ- HOSANNA PARISH][",
    "family_tag":"][1. The Law of Priority][2. The Law of Pursuit][3. The Law of Possession][4. The Law of Purity]["
  }
]
